anton-vinogradov/esp32-leshy/tests/native/clean_target_tests.cpp
    SelfTestFacts failedRf = healthy;
    failedRf.cc1101SpectrumExercisePassed = false;
    SelfTestController activeFailure;
    CHECK(activeFailure.nextMode());
    CHECK(activeFailure.activate(failedRf, 700));
    CHECK(activeFailure.activate(failedRf, 710));
    for (std::uint8_t state = 1;
         state < SelfTestController::kVisualStateCount; ++state) {
        CHECK(activeFailure.activate(failedRf, 710 + state));
    }
    CHECK(activeFailure.activate(failedRf, 720));
    CHECK(activeFailure.view() == SelfTestView::ActiveChecks);
    CHECK(activeFailure.completeActiveChecks(failedRf, 730));
    CHECK(activeFailure.report().status == SelfTestResultStatus::Fail);
    CHECK(activeFailure.report().passed == 25);
    CHECK(activeFailure.report().failed == 1);
    CHECK(activeFailure.report().blocked == 1);

    SelfTestFacts missingArtifact = healthy;
    missingArtifact.capturePcapAuditApplicable = false;
    missingArtifact.capturePcapAuditPassed = false;
    SelfTestController optionalCapture;
    CHECK(optionalCapture.nextMode());
    CHECK(optionalCapture.activate(missingArtifact, 740));
    CHECK(optionalCapture.activate(missingArtifact, 750));
    for (std::uint8_t state = 1;
         state < SelfTestController::kVisualStateCount; ++state) {
        CHECK(optionalCapture.activate(missingArtifact, 750 + state));
    }
    CHECK(optionalCapture.activate(missingArtifact, 760));
    CHECK(optionalCapture.completeActiveChecks(missingArtifact, 770));
    CHECK(optionalCapture.report().status == SelfTestResultStatus::Blocked);
    CHECK(optionalCapture.report().passed == 25);
    CHECK(optionalCapture.report().failed == 0);
    CHECK(optionalCapture.report().blocked == 1);
    CHECK(optionalCapture.report().notApplicable == 4);
    CHECK(optionalCapture.report().checks[24].status ==
          SelfTestResultStatus::NotApplicable);

    SelfTestFacts cancelled = healthy;
    SelfTestController activeCancel;
    CHECK(activeCancel.nextMode());
    CHECK(activeCancel.activate(cancelled, 800));
    CHECK(activeCancel.activate(cancelled, 810));
    for (std::uint8_t state = 1;
         state < SelfTestController::kVisualStateCount; ++state) {
        CHECK(activeCancel.activate(cancelled, 810 + state));
    }
    CHECK(activeCancel.activate(cancelled, 820));
    CHECK(activeCancel.back());
    CHECK(activeCancel.view() == SelfTestView::Preflight);
    CHECK(activeCancel.report().cancelled);
    CHECK(!activeCancel.runAwaitingFinish());
}

void testDisposableScratchCleanupPermitIsExactAndFailClosed() {
    leshy1::storage::MediaIdentity media;
    media.present = true;
    media.kind = leshy1::storage::MediaKind::Sd;
    media.fingerprint = "FE343253440000002000000055019CB7";
    media.capacityBytes = 16ULL * 1024ULL * 1024ULL * 1024ULL;
    media.freeBytes = 8ULL * 1024ULL * 1024ULL * 1024ULL;

    leshy1::storage::ScratchCleanupRequest request;
    request.explicitlyDisposable = true;
    request.expectedFingerprint = media.fingerprint;
    request.runId = "full-guided-v7";
    request.scratchExists = true;
    const auto permit =
        leshy1::storage::authorizeScratchCleanup(media, request);
    CHECK(permit.allowed());
    CHECK(std::strcmp(permit.scratchPath,
                      "/leshy-hil/full-guided-v7") == 0);
    CHECK(std::strcmp(leshy1::storage::scratchCleanupStatusName(permit.status),
                      "permitted") == 0);

    request.explicitlyDisposable = false;
    CHECK(leshy1::storage::authorizeScratchCleanup(media, request).status ==
          leshy1::storage::ScratchCleanupStatus::
              ExplicitAuthorizationRequired);
    request.explicitlyDisposable = true;
    request.expectedFingerprint = "DIFFERENT";
    CHECK(leshy1::storage::authorizeScratchCleanup(media, request).status ==
          leshy1::storage::ScratchCleanupStatus::FingerprintMismatch);
    request.expectedFingerprint = media.fingerprint;
    request.runId = "../product";
    CHECK(leshy1::storage::authorizeScratchCleanup(media, request).status ==
          leshy1::storage::ScratchCleanupStatus::InvalidRunId);
    request.runId = "full-guided-v7";
    request.scratchExists = false;
    CHECK(leshy1::storage::authorizeScratchCleanup(media, request).status ==
          leshy1::storage::ScratchCleanupStatus::ScratchMissing);

    CHECK(leshy1::storage::isSessionStoreScratchFileName("head-a.bin"));
    CHECK(leshy1::storage::isSessionStoreScratchFileName("head-b.bin"));
    CHECK(leshy1::storage::isSessionStoreScratchFileName(
        "segment-00000001.bin"));
    CHECK(leshy1::storage::isSessionStoreScratchFileName(
        "manifest-42949672.bin"));
    CHECK(!leshy1::storage::isSessionStoreScratchFileName("notes.txt"));
    CHECK(!leshy1::storage::isSessionStoreScratchFileName(
        "segment-00000001.bin.bak"));
    CHECK(!leshy1::storage::isSessionStoreScratchFileName(
        "../segment-00000001.bin"));
}

void testShieldReceiverIdentityContractFailsClosed() {
    ShieldReceiverProbeReport passing;
    passing.profileDeclared = true;
    passing.gpsExcludedByProfile = true;
    passing.pn532ExcludedByProfile = true;
    passing.resourceAcquired = true;
    passing.gpio21StableHigh = true;
    passing.cleanupComplete = true;
    passing.nrfRegisterReads = 8;
    passing.ccStatusReads = 2;
    passing.spiBytesClocked = 20;
    passing.nrf[0] = {0x0E, 0x08, 2, 0x0E, 0, false};
    passing.nrf[1] = {0x0E, 0x08, 40, 0x0E, 0, false};
    passing.cc1101 = {0x0F, 0x00, 0x14, true, false};
    finalizeShieldReceiverProbe(&passing);
    CHECK(passing.status == ShieldReceiverProbeStatus::Pass);
    CHECK(passing.detectedReceivers == 3);
    CHECK(passing.nrf[0].detected && passing.nrf[1].detected);
    CHECK(passing.cc1101.detected);
    CHECK(std::strcmp(shieldReceiverProbeStatusName(passing.status), "pass") == 0);

    ShieldReceiverProbeReport floating = passing;
    floating.nrf[0] = {};
    floating.nrf[1] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, false};
    floating.cc1101 = {0xFF, 0xFF, 0xFF, false, false};
    finalizeShieldReceiverProbe(&floating);
    CHECK(floating.status == ShieldReceiverProbeStatus::Failed);
    CHECK(floating.detectedReceivers == 0);

