anton-vinogradov/esp32-leshy/tests/native/clean_target_tests.cpp
    ShieldReceiverProbeReport partial = passing;
    partial.nrf[1] = {};
    finalizeShieldReceiverProbe(&partial);
    CHECK(partial.status == ShieldReceiverProbeStatus::Partial);
    CHECK(partial.detectedReceivers == 2);

    ShieldReceiverProbeReport unsafe = passing;
    unsafe.nrfCeHighEvents = 1;
    finalizeShieldReceiverProbe(&unsafe);
    CHECK(unsafe.status == ShieldReceiverProbeStatus::Failed);
    unsafe = passing;
    unsafe.ccCommandStrobes = 1;
    finalizeShieldReceiverProbe(&unsafe);
    CHECK(unsafe.status == ShieldReceiverProbeStatus::Failed);
    unsafe = passing;
    unsafe.radioTxCommands = 1;
    finalizeShieldReceiverProbe(&unsafe);
    CHECK(unsafe.status == ShieldReceiverProbeStatus::Failed);
    unsafe = passing;
    unsafe.gpio21StableHigh = false;
    finalizeShieldReceiverProbe(&unsafe);
    CHECK(unsafe.status == ShieldReceiverProbeStatus::Failed);

    ShieldReceiverProbeReport refused = passing;
    refused.gpsExcludedByProfile = false;
    finalizeShieldReceiverProbe(&refused);
    CHECK(refused.status == ShieldReceiverProbeStatus::RefusedProfile);
    ShieldReceiverProbeReport busy = passing;
    busy.resourceAcquired = false;
    finalizeShieldReceiverProbe(&busy);
    CHECK(busy.status == ShieldReceiverProbeStatus::Busy);
}

void testNrf24PassiveSpectrumContractAndControllerAreBounded() {
    const Nrf24PassiveSpectrumPlan plan =
        defaultNrf24PassiveSpectrumPlan();
    CHECK(validateNrf24PassiveSpectrumPlan(plan));
    CHECK(plan.firstChannel == 2);
    CHECK(plan.lastChannel == 84);
    CHECK(plan.dwellUs == 200);
    Nrf24PassiveSpectrumPlan unsafePlan = plan;
    unsafePlan.maximumModules = 4;
    CHECK(!validateNrf24PassiveSpectrumPlan(unsafePlan));
    unsafePlan = plan;
    unsafePlan.dwellUs = 100;
    CHECK(!validateNrf24PassiveSpectrumPlan(unsafePlan));

    Nrf24PassiveSpectrumReport report;
    report.status = Nrf24PassiveSpectrumStatus::Ready;
    report.profileDeclared = true;
    report.gpsExcludedByProfile = true;
    report.pn532ExcludedByProfile = true;
    report.resourceOwned = true;
    report.gpio21StableHigh = true;
    report.detectedModules = 2;
    report.activeSlotMask = 0x06;
    report.cleanupComplete = false;
    CHECK(validateNrf24PassiveSpectrumReport(report, false));
    CHECK(!validateNrf24PassiveSpectrumReport(report, true));
    report.cleanupComplete = true;
    CHECK(validateNrf24PassiveSpectrumReport(report, true));
    Nrf24PassiveSpectrumReport unsafe = report;
    unsafe.txModeEntries = 1;
    CHECK(!validateNrf24PassiveSpectrumReport(unsafe, true));
    unsafe = report;
    unsafe.txPayloadCommands = 1;
    CHECK(!validateNrf24PassiveSpectrumReport(unsafe, true));
    unsafe = report;
    unsafe.activeSlotMask = 0x07;
    CHECK(!validateNrf24PassiveSpectrumReport(unsafe, true));
    unsafe = report;
    unsafe.status = Nrf24PassiveSpectrumStatus::Fault;
    CHECK(!validateNrf24PassiveSpectrumReport(unsafe, true));

    Nrf24SpectrumController controller;
    CHECK(controller.start(2, 1000));
    CHECK(controller.state() == Nrf24SpectrumViewState::Running);
    Nrf24PassiveSweep sweep;
    sweep.modules = 2;
    sweep.startedUs = 1000;
    sweep.endedUs = 2000;
    sweep.sampled.fill(1);
    sweep.sweepComplete = true;
    sweep.valid = true;
    sweep.hits[10] = 1;
    sweep.hits[40] = 1;
    CHECK(controller.ingest(sweep));
    CHECK(controller.sweeps() == 1);
    CHECK(controller.totalHits() == 2);
    CHECK(controller.activeBins() == 2);
    CHECK(controller.intensity(10) == 31);
    CHECK(controller.displayIntensity(10) == 31);
    CHECK(controller.metric() == Nrf24SpectrumMetric::Signal);
    CHECK(controller.hottestChannel() == 12);
    CHECK(controller.toggleMetric());
    CHECK(controller.metric() == Nrf24SpectrumMetric::Traffic);
    CHECK(controller.displayIntensity(10) == 0);
    CHECK(controller.toggleMetric());
    CHECK(controller.togglePause());
    CHECK(controller.state() == Nrf24SpectrumViewState::Paused);
    CHECK(!controller.ingest(sweep));
    CHECK(controller.togglePause());
    sweep.startedUs = 2001;
    sweep.endedUs = 3000;
    sweep.hits.fill(0);
    CHECK(controller.ingest(sweep));
    CHECK(controller.intensity(10) == 28);
    CHECK(controller.stop());
    CHECK(controller.state() == Nrf24SpectrumViewState::Idle);
    CHECK(controller.start(3, 4000));
    CHECK(controller.stop());
    CHECK(!controller.start(4, 5000));
}

void testCc1101PassiveSpectrumContractAndControllerAreBounded() {
    const auto plan315 = cc1101PassiveSpectrumPlan(
        Cc1101SpectrumBand::Band315);
    const auto plan433 = cc1101PassiveSpectrumPlan(
        Cc1101SpectrumBand::Band433);
    const auto plan868 = cc1101PassiveSpectrumPlan(
        Cc1101SpectrumBand::Band868);
    const auto plan915 = cc1101PassiveSpectrumPlan(
        Cc1101SpectrumBand::Band915);
    CHECK(validateCc1101PassiveSpectrumPlan(plan315));
    CHECK(validateCc1101PassiveSpectrumPlan(plan433));
    CHECK(validateCc1101PassiveSpectrumPlan(plan868));
    CHECK(validateCc1101PassiveSpectrumPlan(plan915));
    CHECK(cc1101SpectrumFrequencyKHz(plan433, 0) == 433050);
    CHECK(cc1101SpectrumFrequencyKHz(plan433, 63) == 434790);
    Cc1101PassiveSpectrumPlan unsafePlan = plan433;
    unsafePlan.firstKHz = 348001;
    CHECK(!validateCc1101PassiveSpectrumPlan(unsafePlan));
    unsafePlan = plan433;
    unsafePlan.settleUs = 100;
    CHECK(!validateCc1101PassiveSpectrumPlan(unsafePlan));

    Cc1101PassiveSpectrumReport report;
    report.status = Cc1101PassiveSpectrumStatus::Ready;
    report.profileDeclared = true;
    report.gpsExcludedByProfile = true;
    report.pn532ExcludedByProfile = true;
    report.resourceOwned = true;
    report.gpio21StableHigh = true;
    report.receiverDetected = true;
    report.partNumber = 0;
    report.version = 0x14;
    report.commandStrobes = 7;
    report.resetStrobes = 1;
    report.receiveStrobes = 2;
    report.idleStrobes = 4;
    report.receiveReadyTimeouts = 1;
    report.transientRetries = 1;
    report.cleanupComplete = false;
    CHECK(validateCc1101PassiveSpectrumReport(report, false));
    CHECK(!validateCc1101PassiveSpectrumReport(report, true));
    report.cleanupComplete = true;
    CHECK(validateCc1101PassiveSpectrumReport(report, true));
    Cc1101PassiveSpectrumReport unsafe = report;
    unsafe.txStrobes = 1;
    CHECK(!validateCc1101PassiveSpectrumReport(unsafe, true));
    unsafe = report;
    unsafe.paTableWrites = 1;
    CHECK(!validateCc1101PassiveSpectrumReport(unsafe, true));
    unsafe = report;
    unsafe.commandStrobes = 8;
    CHECK(!validateCc1101PassiveSpectrumReport(unsafe, true));
    unsafe = report;
    unsafe.transientRetries = 2;
    CHECK(!validateCc1101PassiveSpectrumReport(unsafe, true));
    unsafe = report;
    unsafe.recoveries = 1;
    CHECK(!validateCc1101PassiveSpectrumReport(unsafe, true));
    report.selectReadyTimeouts = 1;
    report.recoveryAttempts = 1;
    report.recoveries = 1;
    CHECK(validateCc1101PassiveSpectrumReport(report, true));

    Cc1101SpectrumController controller;
    CHECK(controller.start(1000));
    CHECK(controller.state() == Cc1101SpectrumViewState::Running);
    CHECK(controller.band() == Cc1101SpectrumBand::Band433);
    Cc1101PassiveSample sample;
    sample.band = Cc1101SpectrumBand::Band433;
    sample.bin = 0;
    sample.frequencyKHz = cc1101SpectrumFrequencyKHz(plan433, 0);
    sample.rssiDbm = -90;
    sample.startedUs = 1000;
    sample.endedUs = 1100;
    sample.valid = true;
    CHECK(controller.ingest(sample));
    CHECK(controller.nextBin() == 1);
    CHECK(controller.samples() == 1);
    CHECK(controller.intensity(0) == 28);
    CHECK(controller.peakKHz() == 433050);
    CHECK(controller.peakRssiDbm() == -90);
    CHECK(!controller.ingest(sample));
    for (std::uint8_t bin = 1; bin < 64; ++bin) {
        sample.bin = bin;
        sample.frequencyKHz = cc1101SpectrumFrequencyKHz(plan433, bin);
        sample.rssiDbm = static_cast<std::int16_t>(-100 + bin / 4);
        sample.startedUs = 1100 + static_cast<std::uint64_t>(bin) * 100;
        sample.endedUs = sample.startedUs + 50;
        CHECK(controller.ingest(sample));
    }
    CHECK(controller.sweeps() == 1);
    CHECK(controller.nextBin() == 0);
    CHECK(controller.samples() == 64);
    CHECK(controller.togglePause());
    CHECK(controller.state() == Cc1101SpectrumViewState::Paused);
    CHECK(!controller.ingest(sample));
    CHECK(controller.nextBand());
    CHECK(controller.band() == Cc1101SpectrumBand::Band868);
    CHECK(controller.sweeps() == 0);
    CHECK(controller.samples() == 0);
    CHECK(controller.previousBand());
    CHECK(controller.band() == Cc1101SpectrumBand::Band433);
    CHECK(controller.togglePause());
    CHECK(controller.stop());
    CHECK(controller.state() == Cc1101SpectrumViewState::Idle);

    Cc1101SpectrumController selectedBand;
    CHECK(selectedBand.start(Cc1101SpectrumBand::Band915, 2000));
    CHECK(selectedBand.band() == Cc1101SpectrumBand::Band915);
    CHECK(selectedBand.plan().firstKHz == plan915.firstKHz);
    CHECK(selectedBand.stop());
    CHECK(!selectedBand.start(Cc1101SpectrumBand::Count, 3000));
    CHECK(!selectedBand.start(
        static_cast<Cc1101SpectrumBand>(255), 3000));
}

void testSubGhzRawCaptureIsPassiveBoundedAndNonBlocking() {
    SubGhzRawCapturePlan plan;
    CHECK(validateSubGhzRawCapturePlan(plan));
    SubGhzRawCapturePlan invalid = plan;
    invalid.frequencyKHz = 370000;
    CHECK(!validateSubGhzRawCapturePlan(invalid));
    invalid = plan;
    invalid.maximumPulses = SubGhzRawCapture::kPulseCapacity + 1U;
    CHECK(!validateSubGhzRawCapturePlan(invalid));
    invalid = plan;
    invalid.maximumCaptureMs = 0;
    CHECK(!validateSubGhzRawCapturePlan(invalid));
    invalid = plan;
    invalid.modulation =
        leshy1::domain::captures::SubGhzRawModulation::FskAsync;
    CHECK(!validateSubGhzRawCapturePlan(invalid));

