anton-vinogradov/esp32-leshy/tests/native/clean_target_tests.cpp
    segment[100] ^= 0x01;
    PersistedSubGhzRawCaptureView corrupt;
    CHECK(openPersistedSubGhzRawCapture(
              reopened, segment.data(), segmentSize, &corrupt) !=
          SessionCodecStatus::Valid);
}

void testInfraredCaptureIsBoundedAndDecodesNecWithoutTxSemantics() {
    InfraredCapturePlan plan;
    CHECK(validateInfraredCapturePlan(plan));
    InfraredCapturePlan invalid = plan;
    invalid.maximumPulses = InfraredCapture::kPulseCapacity + 1U;
    CHECK(!validateInfraredCapturePlan(invalid));
    invalid = plan;
    invalid.maximumSampleGapUs = 10;
    CHECK(!validateInfraredCapturePlan(invalid));

    InfraredCapture capture;
    std::uint64_t now = 1000000;
    CHECK(capture.begin(plan, now, true));
    CHECK(capture.stats().state == InfraredCaptureState::Waiting);
    CHECK(capture.ingest({now + 100, false}));
    now += 100;
    CHECK(capture.stats().state == InfraredCaptureState::Capturing);

    const auto pulse = [&](bool level, std::uint16_t durationUs,
                           bool nextLevel) {
        const std::uint64_t ended = now + durationUs;
        while (now + 100U < ended) {
            now += 100U;
            CHECK(!capture.ingest({now, level}));
        }
        now = ended;
        CHECK(capture.ingest({now, nextLevel}));
    };

    // NEC: address 0x10, inverted address 0xEF, command 0x34,
    // inverted command 0xCB. Bytes and bits are transmitted LSB first.
    constexpr std::uint32_t code = 0xCB34EF10U;
    pulse(false, 9000, true);
    pulse(true, 4500, false);
    for (std::uint8_t bit = 0; bit < 32U; ++bit) {
        pulse(false, 560, true);
        pulse(true, (code & (1U << bit)) != 0 ? 1690 : 560, false);
    }
    pulse(false, 560, true);
    CHECK(capture.service(now + plan.endGapUs));
    CHECK(capture.stats().state == InfraredCaptureState::Complete);
    CHECK(capture.pulseCount() == 67);
    CHECK(capture.decode().protocol ==
          leshy1::domain::captures::InfraredProtocol::Nec);
    CHECK(capture.decode().rawCode == code);
    CHECK(capture.decode().address == 0x10);
    CHECK(capture.decode().command == 0x34);
    CHECK(capture.decode().integrityValid);
    CHECK(!capture.stats().truncated);

    leshy1::domain::captures::InfraredRawPulseView raw;
    CHECK(capture.pulseView(0, &raw));
    CHECK(raw.durationUs == 9000);
    char csv[96] = {};
    CHECK(formatInfraredCsvHeader(csv, sizeof(csv)).valid);
    CHECK(std::strcmp(csv, "pulse_index,level,duration_us\r\n") == 0);
    CHECK(formatInfraredCsvRow(capture, 0, false, csv, sizeof(csv)).valid);
    CHECK(std::strcmp(csv, "0,0,9000\r\n") == 0);

    SurveySession artifact;
    CHECK(artifact.start("ir-raw-01", capture.stats().startedUs) ==
          SessionStatus::Started);
    CaptureMetadata metadata;
    metadata.present = true;
    metadata.passive = true;
    metadata.infraredRawCaptured = true;
    metadata.infraredStartLevel = capture.stats().startLevel;
    metadata.infraredTruncated = capture.stats().truncated;
    metadata.infraredPulseRecords = static_cast<std::uint16_t>(
        capture.pulseCount());
    metadata.infraredPulseBytes = static_cast<std::uint32_t>(
        capture.pulseCount() * 2U);
    metadata.infraredDecode = capture.decode();
    metadata.appIdentity.fill(0x6B);
    metadata.appIdentityLength = metadata.appIdentity.size();
    CHECK(artifact.configureCaptureMetadata(metadata) ==
          CaptureMetadataStatus::Configured);
    CHECK(artifact.stop(capture.stats().endedUs) == SessionStatus::Stopped);

    std::array<std::uint8_t, kSessionSegmentMaxBytes> segment{};
    std::array<std::uint8_t, kSessionManifestMaxBytes> manifest{};
    std::size_t segmentSize = 0;
    std::size_t manifestSize = 0;
    CHECK(encodeInfraredRawCaptureSegment(
              artifact, capture, segment.data(), segment.size(), &segmentSize) ==
          SessionCodecStatus::Valid);
    CHECK(encodeSessionManifest(
              artifact, segment.data(), segmentSize, manifest.data(),
              manifest.size(), &manifestSize) == SessionCodecStatus::Valid);
    SessionManifest decodedManifest;
    CHECK(decodeSessionManifest(manifest.data(), manifestSize,
                                &decodedManifest) == SessionCodecStatus::Valid);
    CHECK(decodedManifest.schemaVersion == kInfraredRawSessionSchemaVersion);
    SurveySession reopened;
    CHECK(reopenSession(manifest.data(), manifestSize, segment.data(),
                        segmentSize, &reopened) == SessionCodecStatus::Valid);
    CHECK(reopened.captureMetadata().infraredRawCaptured);
    CHECK(!reopened.captureMetadata().subGhzRawCaptured);
    CHECK(reopened.captureMetadata().infraredDecode.protocol ==
          leshy1::domain::captures::InfraredProtocol::Nec);
    CHECK(reopened.captureMetadata().infraredDecode.rawCode == code);
    PersistedInfraredRawCaptureView persisted;
    CHECK(openPersistedInfraredRawCapture(
              reopened, segment.data(), segmentSize, &persisted) ==
          SessionCodecStatus::Valid);
    CHECK(persisted.pulseCount() == capture.pulseCount());
    CHECK(persisted.pulseView(0, &raw));
    CHECK(raw.durationUs == 9000);
    char json[640] = {};
    CHECK(formatSessionJsonSummary(reopened, json, sizeof(json)));
    CHECK(std::strstr(json, "leshy.capture.infrared_raw.v1") != nullptr);
    CHECK(std::strstr(json, "\"protocol\":\"nec\"") != nullptr);
    CHECK(std::strstr(json, "\"rx_only\":true") != nullptr);

    leshy1::platform::arduino::RamSessionStoreIo store;
    SessionStoreWorkspace workspace;
    const SessionStoreCommitResult committed = commitNextInfraredRawCapture(
        store, workspace, artifact, capture);
    CHECK(committed.complete());
    SurveySession storeReopened;
    const SessionStoreRecoveryResult recovered = recoverSession(
        store, workspace, &storeReopened);
    CHECK(recovered.valid());
    CHECK(storeReopened.captureMetadata().infraredRawCaptured);

    segment[116] ^= 0x01;
    PersistedInfraredRawCaptureView corrupt;
    CHECK(openPersistedInfraredRawCapture(
              reopened, segment.data(), segmentSize, &corrupt) !=
          SessionCodecStatus::Valid);

    capture.reset();
    CHECK(capture.begin(plan, 2000000, true));
    CHECK(capture.service(12000000));
    CHECK(capture.stats().state == InfraredCaptureState::TimedOut);

    capture.reset();
    CHECK(capture.begin(plan, 13000000, true));
    CHECK(capture.ingest({13000100, false}));
    CHECK(capture.ingest({13001000, false}));
    CHECK(capture.stats().state == InfraredCaptureState::Unreliable);
    CHECK(capture.stats().maximumObservedSampleGapUs == 900);

    capture.reset();
    CHECK(capture.begin(plan, 14000000, true));
    CHECK(capture.cancel(14000100));
    CHECK(capture.stats().state == InfraredCaptureState::Cancelled);
    capture.reset();
    CHECK(capture.begin(plan, 15000000, true));
    CHECK(capture.fail(-9, 15000100));
    CHECK(capture.stats().state == InfraredCaptureState::Failed);
}

void testSpectrumViewportKeepsBoundedRingHistory() {
    CHECK(SpectrumViewport::kDisplayColumns == 240);
    CHECK(SpectrumViewport::kHistoryRows == 224);
    CHECK(SpectrumViewport::kRowBytes == 83);
    CHECK(SpectrumViewport::kHistoryStorageBytes == 18592);
    SpectrumViewport viewport;
    CHECK(!viewport.reset(0));
    CHECK(!viewport.reset(SpectrumViewport::kMaxBins + 1));
    const std::array<std::uint8_t, 2> edgeValues = {0, 255};
    CHECK(SpectrumViewport::resample(edgeValues.data(), edgeValues.size(), 0) ==
          0);
    CHECK(SpectrumViewport::resample(edgeValues.data(), edgeValues.size(),
                                     SpectrumViewport::kDisplayColumns - 1) ==
          255);
    CHECK(SpectrumViewport::resample(edgeValues.data(), edgeValues.size(),
                                     SpectrumViewport::kDisplayColumns / 2) ==
          255);
    CHECK(viewport.reset(83));
    CHECK(viewport.mode() == SpectrumDisplayMode::Spectrum);
    CHECK(viewport.rowsStored() == 0);

    std::array<std::uint8_t, 83> row{};
    for (std::size_t index = 0; index < row.size(); ++index) {
        row[index] = static_cast<std::uint8_t>(index);
    }
    CHECK(viewport.push(row.data(), row.size()));
    CHECK(viewport.intensity(0, 0) == 0);
    CHECK(viewport.intensity(0, 120) == 41);
    CHECK(viewport.intensity(0, 239) == 82);
    CHECK(viewport.reset(83));
    for (std::size_t index = 0;
         index < SpectrumViewport::kHistoryRows; ++index) {
        row.fill(static_cast<std::uint8_t>(index));
        CHECK(viewport.push(row.data(), row.size()));
    }
    CHECK(viewport.rowsStored() == SpectrumViewport::kHistoryRows);
    CHECK(viewport.nextRow() == 0);
    CHECK(viewport.latestRow() == SpectrumViewport::kHistoryRows - 1);
    CHECK(viewport.intensity(17, 82) == 17);

    row.fill(201);
    CHECK(viewport.push(row.data(), row.size()));
    CHECK(viewport.nextRow() == 1);
    CHECK(viewport.latestRow() == 0);
    CHECK(viewport.intensity(0, 82) == 201);
    CHECK(!viewport.push(row.data(), 64));
    std::array<std::uint8_t, 64> ccRow{};
    for (std::size_t index = 0; index < ccRow.size(); ++index) {
        ccRow[index] = static_cast<std::uint8_t>(index);
    }
    CHECK(viewport.reset(ccRow.size()));
    CHECK(viewport.push(ccRow.data(), ccRow.size()));
    CHECK(viewport.intensity(0, 239) == 63);
    CHECK(viewport.nextMode());
    CHECK(viewport.mode() == SpectrumDisplayMode::Waterfall);
    CHECK(viewport.previousMode());
    CHECK(viewport.mode() == SpectrumDisplayMode::Spectrum);
}

