anton-vinogradov/esp32-leshy/tests/native/clean_target_tests.cpp
void testProductBootRetryIsNarrowAndBounded() {
    CHECK(isProductBootRetryReset(true, false, false));
    CHECK(isProductBootRetryReset(true, true, false));
    CHECK(isProductBootRetryReset(false, true, true));
    CHECK(!isProductBootRetryReset(false, true, false));
    CHECK(!isProductBootRetryReset(false, false, true));
    CHECK(!shouldResetProductBootRetryState(true, true, true, true));
    CHECK(shouldResetProductBootRetryState(false, true, true, true));
    CHECK(shouldResetProductBootRetryState(true, false, true, true));
    CHECK(shouldResetProductBootRetryState(true, true, false, true));
    CHECK(shouldResetProductBootRetryState(true, true, true, false));
    CHECK(kProductBootRecoveryWatchdogMs == 4000);
    CHECK(kProductBootRecoveryHardwareWatchdogMs == 5000);
    CHECK(kProductBootMaximumAttempts == 8);
    CHECK(kSdMaxR1PollBytes == 16);

    ProductBootRetryEvidence evidence;
    evidence.identityFailed = true;
    evidence.enrolled = true;
    evidence.expectedFingerprintValid = true;
    evidence.observedFingerprintEmpty = true;
    evidence.missingMedia = true;
    evidence.cleanupComplete = true;
    CHECK(shouldRetryProductBootRecovery(evidence, 1));
    CHECK(shouldRetryProductBootRecovery(evidence, 2));
    CHECK(shouldRetryProductBootRecovery(evidence, 3));
    CHECK(shouldRetryProductBootRecovery(evidence, 7));
    CHECK(!shouldRetryProductBootRecovery(evidence, 0));
    CHECK(!shouldRetryProductBootRecovery(evidence, 8));
    CHECK(productBootRetryDelayMs(0) == 0);
    CHECK(productBootRetryDelayMs(1) == 250);
    CHECK(productBootRetryDelayMs(2) == 500);
    CHECK(productBootRetryDelayMs(3) == 750);
    CHECK(productBootRetryDelayMs(7) == 1750);
    CHECK(productBootRetryDelayMs(8) == 0);

    ProductBootRetryEvidence mutated = evidence;
    mutated.identityFailed = false;
    CHECK(!shouldRetryProductBootRecovery(mutated, 1));
    mutated = evidence;
    mutated.enrolled = false;
    CHECK(!shouldRetryProductBootRecovery(mutated, 1));
    mutated = evidence;
    mutated.expectedFingerprintValid = false;
    CHECK(!shouldRetryProductBootRecovery(mutated, 1));
    mutated = evidence;
    mutated.observedFingerprintEmpty = false;
    CHECK(!shouldRetryProductBootRecovery(mutated, 1));
    mutated = evidence;
    mutated.fingerprintMatched = true;
    CHECK(!shouldRetryProductBootRecovery(mutated, 1));
    mutated = evidence;
    mutated.mountedReadOnly = true;
    CHECK(!shouldRetryProductBootRecovery(mutated, 1));
    mutated = evidence;
    mutated.rootExists = true;
    CHECK(!shouldRetryProductBootRecovery(mutated, 1));
    mutated = evidence;
    mutated.opened = true;
    CHECK(!shouldRetryProductBootRecovery(mutated, 1));
    mutated = evidence;
    mutated.catalogAdmitted = true;
    CHECK(!shouldRetryProductBootRecovery(mutated, 1));
    mutated = evidence;
    mutated.missingMedia = false;
    CHECK(!shouldRetryProductBootRecovery(mutated, 1));
    mutated = evidence;
    mutated.blockedWriteAttempts = 1;
    CHECK(!shouldRetryProductBootRecovery(mutated, 1));
    mutated = evidence;
    mutated.ownedAfter = 12;
    CHECK(!shouldRetryProductBootRecovery(mutated, 1));
    mutated = evidence;
    mutated.cleanupComplete = false;
    CHECK(!shouldRetryProductBootRecovery(mutated, 1));
}

void testSafetySupervisorLatchesOnlyExactUntornEvidence() {
    using namespace leshy1::kernel::safety;
    constexpr std::uint32_t app = 0x10203040U;
    const SafetyRetainedRecord retained = makeSafetyRetainedRecord(
        app, SafetyReason::RuntimeWatchdog, 2, 2, false);
    CHECK(validateSafetyRetainedRecord(retained, app));
    CHECK(!validateSafetyRetainedRecord(retained, app + 1U));
    CHECK(shouldLatchSafetyStop(retained, app, true));
    CHECK(!shouldLatchSafetyStop(retained, app, false));

    const SafetyRetainedRecord confirmed = makeSafetyRetainedRecord(
        app, SafetyReason::RuntimeWatchdog, 2, 2, true);
    CHECK(shouldLatchSafetyStop(confirmed, app, false));

    SafetyRetainedRecord torn = retained;
    ++torn.tripCount;
    CHECK(!validateSafetyRetainedRecord(torn, app));
    torn = retained;
    torn.reasonInverse = retained.reason;
    CHECK(!validateSafetyRetainedRecord(torn, app));
    torn = retained;
    torn.latchConfirmed = 1;
    CHECK(validateSafetyRetainedRecord(torn, app));
    CHECK(shouldLatchSafetyStop(torn, app, false));
    torn = retained;
    torn.latchConfirmedInverse = ~0U;
    CHECK(!validateSafetyRetainedRecord(torn, app));

    SafetySupervisor supervisor;
    supervisor.restore(retained, app, true);
    CHECK(supervisor.latched());
    CHECK(supervisor.reason() == SafetyReason::RuntimeWatchdog);
    CHECK(supervisor.tripCount() == 2);
    CHECK(supervisor.quiesceCount() == 2);
    CHECK(supervisor.requestClear());
    CHECK(supervisor.clearPending());
    CHECK(!supervisor.confirmClear(false));
    CHECK(supervisor.cancelClear());
    CHECK(supervisor.requestClear());
    CHECK(supervisor.confirmClear(true));
    CHECK(!supervisor.latched());
    CHECK(supervisor.arm());
    CHECK(supervisor.armed());

    const SafetyRetainedRecord unavailable = makeSafetyRetainedRecord(
        app, SafetyReason::SupervisorUnavailable, 1, 1);
    supervisor.restore(unavailable, app, false);
    CHECK(supervisor.latched());
}

void testProductStartIdentityRetryStopsBeforeFilesystem() {
    ProductStartIdentityRetryEvidence evidence;
    evidence.explicitStart = true;
    evidence.enrolled = true;
    evidence.expectedFingerprintValid = true;
    evidence.requiredResourcesHeld = true;
    evidence.physicalSpiStarted = true;
    evidence.identityStatus = SdTransportRunStatus::ExchangeFailed;
    evidence.observedFingerprintEmpty = true;
    evidence.identityCleanupComplete = true;
    for (std::uint8_t attempt = 1;
         attempt < kProductStartMaximumIdentityAttempts; ++attempt) {
        CHECK(shouldRetryProductStartIdentity(evidence, attempt));
    }
    CHECK(!shouldRetryProductStartIdentity(evidence, 0));
    CHECK(!shouldRetryProductStartIdentity(
        evidence, kProductStartMaximumIdentityAttempts));
    CHECK(productStartIdentityRetryDelayMs(0) == 0);
    CHECK(productStartIdentityRetryDelayMs(1) == 250);
    CHECK(productStartIdentityRetryDelayMs(2) == 500);
    CHECK(productStartIdentityRetryDelayMs(7) == 1750);
    CHECK(productStartIdentityRetryDelayMs(8) == 0);
    evidence.identityStatus = SdTransportRunStatus::InitTimeout;
    CHECK(shouldRetryProductStartIdentity(evidence, 1));
    evidence.identityStatus = SdTransportRunStatus::ParseRejected;
    CHECK(shouldRetryProductStartIdentity(evidence, 1));

    ProductStartIdentityRetryEvidence mutated = evidence;
    mutated.explicitStart = false;
    CHECK(!shouldRetryProductStartIdentity(mutated, 1));
    mutated = evidence;
    mutated.enrolled = false;
    CHECK(!shouldRetryProductStartIdentity(mutated, 1));
    mutated = evidence;
    mutated.expectedFingerprintValid = false;
    CHECK(!shouldRetryProductStartIdentity(mutated, 1));
    mutated = evidence;
    mutated.requiredResourcesHeld = false;
    CHECK(!shouldRetryProductStartIdentity(mutated, 1));
    mutated = evidence;
    mutated.physicalSpiStarted = false;
    CHECK(!shouldRetryProductStartIdentity(mutated, 1));
    mutated = evidence;
    mutated.identityStatus = SdTransportRunStatus::InvalidPlan;
    CHECK(!shouldRetryProductStartIdentity(mutated, 1));
    mutated = evidence;
    mutated.observedFingerprintEmpty = false;
    CHECK(!shouldRetryProductStartIdentity(mutated, 1));
    mutated = evidence;
    mutated.identityCleanupComplete = false;
    CHECK(!shouldRetryProductStartIdentity(mutated, 1));
    mutated = evidence;
    mutated.filesystemAttempted = true;
    CHECK(!shouldRetryProductStartIdentity(mutated, 1));
}

void testStorageTimingSummaryUsesNearestRank() {
    std::array<std::uint64_t, 20> timings{};
    for (std::size_t index = 0; index < timings.size(); ++index) {
        timings[index] = static_cast<std::uint64_t>((timings.size() - index) * 10U);
    }
    StorageTimingSummary summary = summarizeStorageTimings(timings.data(), timings.size());
    CHECK(summary.valid);
    CHECK(summary.samples == 20);
    CHECK(summary.totalUs == 2100);
    CHECK(summary.minimumUs == 10);
    CHECK(summary.p50Us == 100);
    CHECK(summary.p95Us == 190);
    CHECK(summary.p99Us == 200);
    CHECK(summary.maximumUs == 200);
    CHECK(!summarizeStorageTimings(nullptr, 1).valid);
    timings[0] = 0;
    CHECK(!summarizeStorageTimings(timings.data(), timings.size()).valid);
}

