anton-vinogradov/esp32-leshy/tests/native/clean_target_tests.cpp
    // A short pulse and an invalid I2C sample cannot create an action.
    CHECK(input.sample(true, 0xBF, 105) == UiAction::Unknown);
    CHECK(input.sample(false, 0x00, 110) == UiAction::Unknown);
    CHECK(input.sample(true, 0xFF, 115) == UiAction::Unknown);
    CHECK(input.sample(true, 0xFF, 130) == UiAction::Unknown);
    CHECK(input.metrics().pressEvents == 0);
    CHECK(input.metrics().readErrors == 1);

    struct Mapping final {
        std::uint8_t raw;
        UiAction action;
    };
    constexpr Mapping mappings[] = {
        {0xBF, UiAction::Select}, {0x7F, UiAction::Up},
        {0xDF, UiAction::Down},   {0xF7, UiAction::Left},
        {0xEF, UiAction::Right},
    };
    std::uint32_t now = 140;
    for (const Mapping& mapping : mappings) {
        CHECK(input.sample(true, mapping.raw, now) == UiAction::Unknown);
        CHECK(input.sample(true, mapping.raw, now + 5) == UiAction::Unknown);
        CHECK(input.sample(true, mapping.raw, now + 15) == mapping.action);
        CHECK(input.stableRaw() == mapping.raw);

        // A held key emits exactly once, including across an invalid read.
        CHECK(input.sample(false, 0xFF, now + 20) == UiAction::Unknown);
        CHECK(input.sample(true, mapping.raw, now + 25) == UiAction::Unknown);
        CHECK(input.sample(true, 0xFF, now + 30) == UiAction::Unknown);
        CHECK(input.sample(true, 0xFF, now + 35) == UiAction::Unknown);
        CHECK(input.sample(true, 0xFF, now + 45) == UiAction::Unknown);
        CHECK(input.stableRaw() == 0xFF);
        now += 60;
    }
    CHECK(input.metrics().pressEvents == 5);
    CHECK(input.metrics().selectPresses == 1);
    CHECK(input.metrics().upPresses == 1);
    CHECK(input.metrics().downPresses == 1);
    CHECK(input.metrics().leftPresses == 1);
    CHECK(input.metrics().rightPresses == 1);
    CHECK(input.metrics().releaseEvents == 5);
    CHECK(input.metrics().stableTransitions == 10);
    CHECK(input.metrics().readErrors == 6);
    CHECK(input.metrics().maximumSampleGapMs >= 10);
}

void testPhysicalButtonFrontendRejectsAmbiguousPressesAndRecovers() {
    Pcf8574ButtonInput input;
    input.reset(0xFF, 0xFFFFFFF0U);
    const std::uint8_t selectAndUp = 0x3F;
    CHECK(input.sample(true, selectAndUp, 0xFFFFFFF5U) == UiAction::Unknown);
    CHECK(input.sample(true, selectAndUp, 0x00000005U) == UiAction::Unknown);
    CHECK(input.metrics().ambiguousPresses == 1);
    CHECK(input.metrics().pressEvents == 0);

    CHECK(input.sample(true, 0xFF, 20) == UiAction::Unknown);
    CHECK(input.sample(true, 0xFF, 35) == UiAction::Unknown);
    CHECK(input.sample(true, 0xBF, 40) == UiAction::Unknown);
    CHECK(input.sample(true, 0xBF, 55) == UiAction::Select);
    CHECK(input.metrics().pressEvents == 1);
}

void testAppCatalogProjectsCapabilityStatesBeforeLaunch() {
    HardwareInventory constrained;
    CHECK(constrained.add({"board.profile", CapabilityState::Available, "runtime", "match"}));
    CHECK(constrained.add({"radio.wifi", CapabilityState::Declared, "builtin", "not_started"}));
    CHECK(constrained.add({"storage.sd", CapabilityState::Unknown, "probe", "not_mounted"}));
    AppCatalog catalog;
    catalog.rebuild(constrained);
    CHECK(catalog.size() == 7);
    CHECK(catalog.get(0) != nullptr && !catalog.get(0)->enabled);
    CHECK(std::strcmp(catalog.get(0)->id, "wifi") == 0);
    CHECK(!catalog.get(0)->simulated);
    CHECK(std::strcmp(catalog.get(0)->reason, "passive source unavailable") == 0);
    CHECK(catalog.get(1) != nullptr && !catalog.get(1)->enabled);
    CHECK(std::strcmp(catalog.get(1)->id, "ble") == 0);
    CHECK(catalog.get(2) != nullptr && catalog.get(2)->enabled);
    CHECK(std::strcmp(catalog.get(2)->id, "spectrum24") == 0);
    CHECK(catalog.get(3) != nullptr && catalog.get(3)->enabled);
    CHECK(std::strcmp(catalog.get(3)->id, "subghz") == 0);
    CHECK((catalog.get(0)->resources & resourceMask(Resource::EspRf)) != 0);
    CHECK(catalog.get(2)->resources ==
          (resourceMask(Resource::UiForeground) |
           resourceMask(Resource::RadioSpi)));
    CHECK(catalog.get(4) != nullptr && !catalog.get(4)->enabled);
    CHECK(std::strcmp(catalog.get(4)->id, "capture") == 0);
    CHECK(catalog.get(4)->page == 4);
    CHECK((catalog.get(4)->resources & resourceMask(Resource::EspRf)) != 0);
    CHECK(catalog.get(5) != nullptr && !catalog.get(5)->enabled);
    CHECK(std::strcmp(catalog.get(5)->reason, "storage unavailable") == 0);
    CHECK((catalog.get(5)->resources & resourceMask(Resource::Storage)) != 0);
    CHECK(catalog.get(6) != nullptr && catalog.get(6)->enabled);
    CHECK(std::strcmp(catalog.get(6)->id, "device") == 0);
    CHECK(std::strcmp(catalog.get(6)->label, "DEVICE") == 0);
    CHECK(catalog.get(6)->page == 9);
    CHECK(catalog.get(6)->resources == resourceMask(Resource::UiForeground));

    HardwareInventory availableInventory;
    CHECK(availableInventory.add(
        {"board.profile", CapabilityState::Available, "runtime", "match"}));
    CHECK(availableInventory.add(
        {"radio.wifi", CapabilityState::Available, "probe", "ready"}));
    CHECK(availableInventory.add(
        {"capture.wifi_passive", CapabilityState::Available, "adapter", "ready"}));
    CHECK(availableInventory.add({"storage.sd", CapabilityState::Available, "probe", "ready"}));
    catalog.rebuild(availableInventory);
    CHECK(catalog.get(0)->enabled);
    CHECK(!catalog.get(1)->enabled);
    CHECK(catalog.get(2)->enabled);
    CHECK(catalog.get(3)->enabled);
    CHECK(catalog.get(4)->enabled);
    CHECK(catalog.get(5)->enabled);
    CHECK((catalog.get(4)->resources & resourceMask(Resource::EspRf)) != 0);

    HardwareInventory simulatedInventory;
    CHECK(simulatedInventory.add(
        {"board.profile", CapabilityState::Available, "runtime", "match"}));
    CHECK(simulatedInventory.add(
        {"radio.wifi", CapabilityState::Declared, "builtin", "not_started"}));
    CHECK(simulatedInventory.add(
        {"survey.simulated", CapabilityState::Available, "golden", "rf_off"}));
    catalog.rebuild(simulatedInventory);
    CHECK(catalog.get(0)->enabled);
    CHECK(catalog.get(0)->simulated);
    CHECK(std::strcmp(catalog.get(0)->reason, "simulated / rf off") == 0);
    CHECK(catalog.get(0)->resources == resourceMask(Resource::UiForeground));

    HardwareInventory persistentSurveyInventory;
    CHECK(persistentSurveyInventory.add(
        {"board.profile", CapabilityState::Available, "runtime", "match"}));
    CHECK(persistentSurveyInventory.add(
        {"radio.wifi", CapabilityState::Declared, "builtin", "not_started"}));
    CHECK(persistentSurveyInventory.add(
        {"survey.simulated", CapabilityState::Available, "golden", "rf_off"}));
    CHECK(persistentSurveyInventory.add(
        {"survey.persistent_passive", CapabilityState::Available,
         "product_catalog", "exact_media"}));
    catalog.rebuild(persistentSurveyInventory);
    CHECK(catalog.get(0)->enabled);
    CHECK(!catalog.get(0)->simulated);
    CHECK(std::strcmp(catalog.get(0)->reason,
                      "passive / persistent") == 0);
    CHECK(catalog.get(0)->resources ==
          (resourceMask(Resource::UiForeground) |
           resourceMask(Resource::EspRf) |
           resourceMask(Resource::Storage) |
           resourceMask(Resource::RadioSpi)));

    HardwareInventory simulatedLibraryInventory;
    CHECK(simulatedLibraryInventory.add(
        {"board.profile", CapabilityState::Available, "runtime", "match"}));
    CHECK(simulatedLibraryInventory.add(
        {"library.simulated", CapabilityState::Available, "ram", "volatile"}));
    catalog.rebuild(simulatedLibraryInventory);
    CHECK(catalog.get(5)->enabled);
    CHECK(catalog.get(5)->simulated);
    CHECK(std::strcmp(catalog.get(5)->reason, "simulated / ram only") == 0);
    CHECK(catalog.get(5)->resources == resourceMask(Resource::UiForeground));

