anton-vinogradov/esp32-leshy/tests/native/clean_target_tests.cpp
    HardwareInventory recoveredLibraryInventory;
    CHECK(recoveredLibraryInventory.add(
        {"board.profile", CapabilityState::Available, "runtime", "match"}));
    CHECK(recoveredLibraryInventory.add(
        {"library.simulated", CapabilityState::Available, "ram", "volatile"}));
    CHECK(recoveredLibraryInventory.add(
        {"library.persistent_session", CapabilityState::Available,
         "recovery", "validated_session_open"}));
    catalog.rebuild(recoveredLibraryInventory);
    CHECK(catalog.get(5)->enabled);
    CHECK(!catalog.get(5)->simulated);
    CHECK(std::strcmp(catalog.get(5)->reason, "ready") == 0);
    CHECK((catalog.get(5)->resources & resourceMask(Resource::Storage)) != 0);
    CHECK(!catalog.get(4)->enabled);
    CHECK(catalog.get(6)->enabled);
}

void testRuntimeAcquiresAtomicallyAndBackReleasesEverything() {
    ResourceBroker broker;
    const ResourceMask ui = resourceMask(Resource::UiForeground);
    const ResourceMask storage = resourceMask(Resource::Storage);
    CHECK(broker.acquire(2, ui));
    CHECK(!broker.acquire(3, ui | storage));
    CHECK(broker.ownerOf(Resource::UiForeground) == 2);
    CHECK(broker.ownerOf(Resource::Storage) == kNoOwner);
    broker.releaseAll(2);

    AppRuntime runtime(broker);
    CHECK(runtime.launch("survey", false, ui | resourceMask(Resource::EspRf)) ==
          LaunchStatus::Disabled);
    CHECK(!runtime.running());
    CHECK(runtime.activeResources() == 0);

    CHECK(broker.acquire(2, ui));
    CHECK(runtime.launch("diagnostics", true, ui) == LaunchStatus::Busy);
    CHECK(!runtime.running());
    broker.releaseAll(2);

    CHECK(runtime.launch("diagnostics", true, ui) == LaunchStatus::Started);
    CHECK(runtime.running());
    CHECK(std::strcmp(runtime.activeApp(), "diagnostics") == 0);
    CHECK(runtime.activeResources() == ui);
    CHECK(runtime.launch("library", true, ui | storage) == LaunchStatus::AlreadyRunning);
    CHECK(runtime.activeResources() == ui);
    CHECK(runtime.stop());
    CHECK(!runtime.running());
    CHECK(runtime.activeResources() == 0);
    CHECK(!runtime.stop());
    CHECK(runtime.launch("", true, ui) == LaunchStatus::InvalidDescriptor);
    CHECK(runtime.launch("diagnostics", true, 0) == LaunchStatus::InvalidDescriptor);
}

void testWifiIngressIsPassiveOnlyAndNormalizesObservations() {
    WifiScanPlan plan = defaultPassivePlan();
    CHECK(validatePassivePlan(plan));
    CHECK(plan.passive);
    CHECK(!kActiveProbeAllowed);
    CHECK(!kDriverStartedInMeasureTarget);

    plan.passive = false;
    CHECK(!validatePassivePlan(plan));
    plan = defaultPassivePlan();
    plan.directedSsid = "directed-probe";
    CHECK(!validatePassivePlan(plan));
    plan = defaultPassivePlan();
    plan.channel = 15;
    CHECK(!validatePassivePlan(plan));
    plan = defaultPassivePlan();
    plan.maxMsPerChannel = kMinimumDwellMs - 1;
    CHECK(!validatePassivePlan(plan));

    WifiScanRecord record;
    record.bssid = {0x02, 0x11, 0x22, 0x33, 0x44, 0x55};
    record.channel = 6;
    record.rssiDbm = -67;
    record.ssid = "field-ap";
    record.ssidLength = 8;
    Observation observation;
    CHECK(normalizePassiveRecord(record, 2000, &observation));
    CHECK(observation.radio == RadioKind::Wifi);
    CHECK(observation.frequencyKhz == 2437000);
    CHECK(observation.channel == 6);
    CHECK(observation.rssiDbm == -67);
    CHECK(observation.identityLength == 6);
    CHECK(observation.identity == record.bssid);
    CHECK(std::strcmp(observation.label.data(), "field-ap") == 0);

    record.channel = 0;
    CHECK(!normalizePassiveRecord(record, 2000, &observation));
    record.channel = 14;
    CHECK(channelFrequencyKhz(record.channel) == 2484000);
    record.rssiDbm = 1;
    CHECK(!normalizePassiveRecord(record, 2000, &observation));
    record.rssiDbm = -67;
    record.bssid = {};
    CHECK(!normalizePassiveRecord(record, 2000, &observation));
}

void testWifiNetworkCatalogKeepsStableUniqueRows() {
    WifiNetworkCatalog catalog;
    WifiScanRecord record;
    record.bssid = {0x02, 0x11, 0x22, 0x33, 0x44, 0x55};
    record.channel = 6;
    record.rssiDbm = -67;
    record.ssid = "field-ap";
    record.ssidLength = 8;
    Observation observation;
    CHECK(normalizePassiveRecord(record, 2000, &observation));
    CHECK(catalog.upsert(observation));
    CHECK(catalog.size() == 1);
    const std::uint32_t insertedRevision = catalog.revision();

    // Timestamp-only updates do not repaint the live screen.
    CHECK(normalizePassiveRecord(record, 3000, &observation));
    CHECK(!catalog.upsert(observation));
    CHECK(catalog.revision() == insertedRevision);
    CHECK(catalog.size() == 1);

    // Signal changes update the same stable BSSID row.
    record.rssiDbm = -51;
    CHECK(normalizePassiveRecord(record, 4000, &observation));
    CHECK(catalog.upsert(observation));
    CHECK(catalog.size() == 1);
    CHECK(catalog.at(0) != nullptr);
    CHECK(catalog.at(0)->rssiDbm == -51);

    record.bssid[5] = 0x56;
    record.channel = 11;
    record.ssid = "second-ap";
    record.ssidLength = 9;
    CHECK(normalizePassiveRecord(record, 5000, &observation));
    CHECK(catalog.upsert(observation));
    CHECK(catalog.size() == 2);
    CHECK(std::strcmp(catalog.at(0)->label.data(), "field-ap") == 0);
    CHECK(std::strcmp(catalog.at(1)->label.data(), "second-ap") == 0);

    observation.radio = RadioKind::Ble;
    CHECK(!catalog.upsert(observation));
    CHECK(catalog.size() == 2);
    catalog.reset();
    CHECK(catalog.size() == 0);
    CHECK(catalog.at(0) == nullptr);
}

void testBleIngressIsReceiveOnlyBoundedAndNormalizesObservations() {
    using leshy1::drivers::ble::BleAdvertisementRecord;
    using leshy1::drivers::ble::BleScanPlan;

    BleScanPlan plan = leshy1::drivers::ble::defaultPassivePlan();
    CHECK(leshy1::drivers::ble::validatePassivePlan(plan));
    CHECK(plan.passive);
    CHECK(plan.windowMs <= plan.intervalMs);

    plan.passive = false;
    CHECK(!leshy1::drivers::ble::validatePassivePlan(plan));
    plan = leshy1::drivers::ble::defaultPassivePlan();
    plan.durationMs = 1500;
    CHECK(!leshy1::drivers::ble::validatePassivePlan(plan));
    plan = leshy1::drivers::ble::defaultPassivePlan();
    plan.windowMs = static_cast<std::uint16_t>(plan.intervalMs + 1U);
    CHECK(!leshy1::drivers::ble::validatePassivePlan(plan));
    plan = leshy1::drivers::ble::defaultPassivePlan();
    plan.maximumRecords = 129;
    CHECK(!leshy1::drivers::ble::validatePassivePlan(plan));

    BleAdvertisementRecord record;
    record.address = {0xc0, 0x98, 0xe5, 0x44, 0x33, 0x22};
    record.addressType = 1;
    record.rssiDbm = -61;
    record.name = "field-tag";
    record.nameLength = 9;
    Observation observation;
    CHECK(leshy1::drivers::ble::normalizePassiveRecord(
        record, 3000, &observation));
    CHECK(observation.radio == RadioKind::Ble);
    CHECK(observation.frequencyKhz == 0);
    CHECK(observation.channel == 0);
    CHECK(observation.rssiDbm == -61);
    CHECK(observation.identityLength == 6);
    CHECK(observation.identity == record.address);
    CHECK(std::strcmp(observation.label.data(), "field-tag") == 0);

