anton-vinogradov/esp32-leshy/tests/native/clean_target_tests.cpp
    record.address = {};
    CHECK(!leshy1::drivers::ble::normalizePassiveRecord(
        record, 3000, &observation));
    record.address.fill(0xff);
    CHECK(!leshy1::drivers::ble::normalizePassiveRecord(
        record, 3000, &observation));
    record.address = {1, 2, 3, 4, 5, 6};
    record.rssiDbm = 21;
    CHECK(!leshy1::drivers::ble::normalizePassiveRecord(
        record, 3000, &observation));
    record.rssiDbm = -61;
    record.name = nullptr;
    CHECK(!leshy1::drivers::ble::normalizePassiveRecord(
        record, 3000, &observation));
}

void testSurveySessionIsOrderedBoundedAndStopIsIdempotent() {
    SurveySession session;
    Observation observation;
    observation.monotonicUs = 2000;
    CHECK(session.append(observation) == SessionStatus::NotRunning);
    CHECK(session.start("", 1000) == SessionStatus::InvalidSession);
    CHECK(session.start("bad/id", 1000) == SessionStatus::InvalidSession);
    CHECK(session.start("session-001", 1000) == SessionStatus::Started);
    CHECK(session.start("session-002", 1001) == SessionStatus::AlreadyStarted);
    CHECK(std::strcmp(session.id(), "session-001") == 0);

    for (std::size_t index = 0; index < SurveySession::kObservationCapacity; ++index) {
        observation.monotonicUs = 2000 + index;
        CHECK(session.append(observation) == SessionStatus::Appended);
    }
    CHECK(session.size() == SurveySession::kObservationCapacity);
    CHECK(session.get(0) != nullptr && session.get(0)->sequence == 1);
    CHECK(session.get(session.size() - 1) != nullptr &&
          session.get(session.size() - 1)->sequence == SurveySession::kObservationCapacity);
    CHECK(session.get(session.size()) == nullptr);

    observation.monotonicUs = 3000;
    CHECK(session.append(observation) == SessionStatus::Full);
    CHECK(session.dropped() == 1);
    CHECK(session.stop(1900) == SessionStatus::OutOfOrder);
    CHECK(session.stop(4000) == SessionStatus::Stopped);
    CHECK(session.stop(4001) == SessionStatus::AlreadyStopped);
    CHECK(session.append(observation) == SessionStatus::NotRunning);
    CHECK(std::strcmp(sessionStatusName(SessionStatus::Full), "full") == 0);
}

void testSourceDegradationKeepsOnlyCompatibleSourcesRunning() {
    using leshy1::services::survey::SourceFailureClass;
    const std::uint8_t wifi = sourceMask(RadioKind::Wifi);
    const std::uint8_t ble = sourceMask(RadioKind::Ble);

    const auto bleUnavailable = decideSourceDegradation(
        wifi | ble, 0, RadioKind::Ble, SourceFailureClass::Unavailable);
    CHECK(bleUnavailable.valid);
    CHECK(bleUnavailable.continueSession);
    CHECK(bleUnavailable.activeSourceMask == wifi);
    CHECK(bleUnavailable.unavailableSourceMask == ble);
    CHECK(bleUnavailable.windowState == SourceWindowState::Unavailable);
    CHECK(bleUnavailable.windowReason == SourceWindowReason::DriverUnavailable);
    CHECK(std::strcmp(bleUnavailable.status, "source_degraded") == 0);

    const auto wifiFault = decideSourceDegradation(
        wifi, ble, RadioKind::Wifi, SourceFailureClass::Fault);
    CHECK(wifiFault.valid);
    CHECK(!wifiFault.continueSession);
    CHECK(wifiFault.activeSourceMask == 0);
    CHECK(wifiFault.unavailableSourceMask == (wifi | ble));
    CHECK(wifiFault.windowState == SourceWindowState::Fault);
    CHECK(wifiFault.windowReason == SourceWindowReason::DriverFault);
    CHECK(std::strcmp(wifiFault.status, "all_sources_failed") == 0);

    const auto duplicateFailure = decideSourceDegradation(
        wifi, ble, RadioKind::Ble, SourceFailureClass::Unavailable);
    CHECK(!duplicateFailure.valid);
    CHECK(!duplicateFailure.continueSession);
}

void testSourceTimelineStreamsHonestDutyWindowsAndDrops() {
    SourceTimeline timeline;
    const std::uint8_t wifi = sourceMask(RadioKind::Wifi);
    const std::uint8_t ble = sourceMask(RadioKind::Ble);
    CHECK(kSupportedSourceMask == (wifi | ble));
    CHECK(timeline.start(0, 100) == SourceTimelineStatus::InvalidMask);
    CHECK(timeline.start(static_cast<std::uint8_t>(1U << 7U), 100) ==
          SourceTimelineStatus::InvalidMask);
    CHECK(timeline.start(wifi | ble, 100) == SourceTimelineStatus::Started);
    CHECK(timeline.state() == SourceTimelineState::Running);
    CHECK(timeline.selectedMask() == (wifi | ble));
    CHECK(timeline.source(RadioKind::Wifi) != nullptr &&
          timeline.source(RadioKind::Wifi)->state ==
              SourceWindowState::Scheduled);
    CHECK(timeline.recordObservation(RadioKind::Wifi, true, 105) ==
          SourceTimelineStatus::InvalidState);
    CHECK(timeline.transition(RadioKind::Wifi, SourceWindowState::Active,
                              SourceWindowReason::DutyCycle, 110) ==
          SourceTimelineStatus::InvalidReason);

    CHECK(timeline.transition(RadioKind::Wifi, SourceWindowState::Active,
                              SourceWindowReason::None, 110) ==
          SourceTimelineStatus::Transitioned);
    CHECK(timeline.recordObservation(RadioKind::Wifi, true, 120) ==
          SourceTimelineStatus::ObservationRecorded);
    CHECK(timeline.recordObservation(RadioKind::Wifi, false, 125) ==
          SourceTimelineStatus::ObservationRecorded);
    CHECK(timeline.transition(RadioKind::Ble,
                              SourceWindowState::Unavailable,
                              SourceWindowReason::DriverUnavailable, 130) ==
          SourceTimelineStatus::Transitioned);
    CHECK(timeline.transition(RadioKind::Wifi, SourceWindowState::Scheduled,
                              SourceWindowReason::DutyCycle, 140) ==
          SourceTimelineStatus::Transitioned);
    CHECK(timeline.transition(RadioKind::Ble, SourceWindowState::Active,
                              SourceWindowReason::None, 150) ==
          SourceTimelineStatus::Transitioned);
    CHECK(timeline.recordObservation(RadioKind::Ble, true, 160) ==
          SourceTimelineStatus::ObservationRecorded);
    CHECK(timeline.transition(RadioKind::Wifi, SourceWindowState::Active,
                              SourceWindowReason::None, 159) ==
          SourceTimelineStatus::OutOfOrder);
    CHECK(timeline.stop(200) == SourceTimelineStatus::Stopped);
    CHECK(timeline.state() == SourceTimelineState::Stopped);
    CHECK(timeline.queuedWindows() == 6);
    CHECK(timeline.windowHighWater() == 6);
    CHECK(timeline.overflowEvents() == 0);

