anton-vinogradov/esp32-leshy/tests/native/clean_target_tests.cpp
    const SourceRuntimeSummary* wifiSummary = timeline.source(RadioKind::Wifi);
    const SourceRuntimeSummary* bleSummary = timeline.source(RadioKind::Ble);
    CHECK(wifiSummary != nullptr && wifiSummary->scheduledUs == 70);
    CHECK(wifiSummary != nullptr && wifiSummary->activeUs == 30);
    CHECK(wifiSummary != nullptr && wifiSummary->accepted == 1);
    CHECK(wifiSummary != nullptr && wifiSummary->dropped == 1);
    CHECK(wifiSummary != nullptr && wifiSummary->windows == 3);
    CHECK(wifiSummary != nullptr && wifiSummary->transitions == 2);
    CHECK(bleSummary != nullptr && bleSummary->scheduledUs == 30);
    CHECK(bleSummary != nullptr && bleSummary->unavailableUs == 20);
    CHECK(bleSummary != nullptr && bleSummary->activeUs == 50);
    CHECK(bleSummary != nullptr && bleSummary->accepted == 1);
    CHECK(bleSummary != nullptr && bleSummary->dropped == 0);
    CHECK(timeline.dutyPermille(RadioKind::Wifi, 200) == 300);
    CHECK(timeline.dutyPermille(RadioKind::Ble, 200) == 500);

    static constexpr std::array<RadioKind, 6> kExpectedSources{{
        RadioKind::Wifi, RadioKind::Ble, RadioKind::Wifi,
        RadioKind::Ble, RadioKind::Wifi, RadioKind::Ble,
    }};
    static constexpr std::array<SourceWindowState, 6> kExpectedStates{{
        SourceWindowState::Scheduled, SourceWindowState::Scheduled,
        SourceWindowState::Active, SourceWindowState::Unavailable,
        SourceWindowState::Scheduled, SourceWindowState::Active,
    }};
    for (std::size_t index = 0; index < kExpectedSources.size(); ++index) {
        SourceWindow window;
        CHECK(timeline.pop(&window) ==
              SourceTimelineStatus::WindowDequeued);
        CHECK(window.source == kExpectedSources[index]);
        CHECK(window.state == kExpectedStates[index]);
        CHECK(window.endedUs >= window.startedUs);
    }
    SourceWindow empty;
    CHECK(timeline.pop(&empty) == SourceTimelineStatus::Empty);
    CHECK(std::strcmp(sourceWindowStateName(SourceWindowState::Unavailable),
                      "unavailable") == 0);
    CHECK(std::strcmp(sourceWindowReasonName(
                          SourceWindowReason::DriverUnavailable),
                      "driver_unavailable") == 0);
    CHECK(std::strcmp(sourceTimelineStateName(SourceTimelineState::Stopped),
                      "stopped") == 0);
    CHECK(std::strcmp(sourceTimelineStatusName(SourceTimelineStatus::Full),
                      "full") == 0);
}

void testSourceTimelineOverflowRejectsStateChangeAndCanDrain() {
    SourceTimeline timeline;
    CHECK(timeline.start(sourceMask(RadioKind::Wifi), 1) ==
          SourceTimelineStatus::Started);
    SourceWindowState next = SourceWindowState::Active;
    for (std::size_t index = 0; index < SourceTimeline::kWindowCapacity;
         ++index) {
        CHECK(timeline.transition(RadioKind::Wifi, next,
                                  next == SourceWindowState::Active
                                      ? SourceWindowReason::None
                                      : SourceWindowReason::DutyCycle,
                                  2 + index) ==
              SourceTimelineStatus::Transitioned);
        next = next == SourceWindowState::Active
            ? SourceWindowState::Scheduled : SourceWindowState::Active;
    }
    CHECK(timeline.queuedWindows() == SourceTimeline::kWindowCapacity);
    const SourceWindowState stateBefore =
        timeline.source(RadioKind::Wifi)->state;
    CHECK(timeline.transition(RadioKind::Wifi, next,
                              next == SourceWindowState::Active
                                  ? SourceWindowReason::None
                                  : SourceWindowReason::DutyCycle,
                              18) == SourceTimelineStatus::Full);
    CHECK(timeline.source(RadioKind::Wifi)->state == stateBefore);
    CHECK(timeline.overflowEvents() == 1);
    CHECK(timeline.stop(19) == SourceTimelineStatus::Full);
    CHECK(timeline.state() == SourceTimelineState::Running);
    CHECK(timeline.overflowEvents() == 2);

    SourceWindow drained;
    CHECK(timeline.pop(&drained) == SourceTimelineStatus::WindowDequeued);
    CHECK(timeline.transition(RadioKind::Wifi, next,
                              next == SourceWindowState::Active
                                  ? SourceWindowReason::None
                                  : SourceWindowReason::DutyCycle,
                              18) == SourceTimelineStatus::Transitioned);
    CHECK(timeline.pop(&drained) == SourceTimelineStatus::WindowDequeued);
    CHECK(timeline.stop(19) == SourceTimelineStatus::Stopped);
    CHECK(timeline.source(RadioKind::Wifi)->state ==
          SourceWindowState::Stopped);
}

void testSessionTimelinePersistsBoundedHistoryAndExactAggregates() {
    const std::uint8_t wifiMask = sourceMask(RadioKind::Wifi);
    const std::uint8_t bleMask = sourceMask(RadioKind::Ble);
    SurveySession original;
    CHECK(original.start("timeline-v2", 1000) == SessionStatus::Started);
    CHECK(original.startTimeline(wifiMask | bleMask, 1000) ==
          SessionTimelineStatus::Started);

    Observation observation;
    observation.monotonicUs = 1500;
    observation.radio = RadioKind::Wifi;
    observation.frequencyKhz = 2437000;
    observation.channel = 6;
    observation.rssiDbm = -60;
    observation.identity = {0x02, 0x00, 0x00, 0x00, 0x00, 0x01};
    observation.identityLength = 6;
    std::memcpy(observation.label.data(), "ap", 3);
    observation.labelLength = 2;
    CHECK(original.append(observation) == SessionStatus::Appended);

    static constexpr std::array<SourceWindow, 5> kWindows{{
        {RadioKind::Ble, SourceWindowState::Scheduled,
         SourceWindowReason::DutyCycle, 1000, 1050, 0, 0},
        {RadioKind::Wifi, SourceWindowState::Scheduled,
         SourceWindowReason::DutyCycle, 1000, 1100, 0, 0},
        {RadioKind::Wifi, SourceWindowState::Active,
         SourceWindowReason::None, 1100, 1900, 1, 0},
        {RadioKind::Ble, SourceWindowState::Unavailable,
         SourceWindowReason::DriverUnavailable, 1050, 2000, 0, 0},
        {RadioKind::Wifi, SourceWindowState::Scheduled,
         SourceWindowReason::DutyCycle, 1900, 2000, 0, 0},
    }};
    for (const SourceWindow& window : kWindows) {
        CHECK(original.appendTimelineWindow(window) ==
              SessionTimelineStatus::Appended);
    }

    SourceRuntimeSummary wifi;
    wifi.selected = true;
    wifi.state = SourceWindowState::Stopped;
    wifi.scheduledUs = 200;
    wifi.activeUs = 800;
    wifi.accepted = 1;
    wifi.windows = 3;
    wifi.transitions = 2;
    SourceRuntimeSummary ble;
    ble.selected = true;
    ble.state = SourceWindowState::Stopped;
    ble.scheduledUs = 50;
    ble.unavailableUs = 950;
    ble.windows = 2;
    ble.transitions = 1;
    CHECK(original.stop(2100) == SessionStatus::TimelineIncomplete);
    CHECK(original.finalizeTimeline(2000, wifi, ble, 0) ==
          SessionTimelineStatus::Finalized);
    CHECK(original.stop(2100) == SessionStatus::Stopped);

    std::array<std::uint8_t, kSessionSegmentMaxBytes> segment{};
    std::array<std::uint8_t, kSessionManifestMaxBytes> manifest{};
    std::size_t segmentSize = 0;
    std::size_t manifestSize = 0;
    CHECK(encodeObservationSegment(original, segment.data(), segment.size(),
                                   &segmentSize) == SessionCodecStatus::Valid);
    CHECK(encodeSessionManifest(original, segment.data(), segmentSize,
                                manifest.data(), manifest.size(),
                                &manifestSize) == SessionCodecStatus::Valid);
    SessionManifest decodedManifest;
    CHECK(decodeSessionManifest(manifest.data(), manifestSize,
                                &decodedManifest) == SessionCodecStatus::Valid);
    CHECK(decodedManifest.schemaVersion == kTimelineSessionSchemaVersion);

