anton-vinogradov/esp32-leshy/tests/native/clean_target_tests.cpp
    SurveySession artifact;
    CHECK(artifact.start("wifi-frames-01", 1000000) == SessionStatus::Started);
    CaptureMetadata metadata;
    metadata.present = true;
    metadata.passive = true;
    metadata.selectedSourceMask = sourceMask(RadioKind::Wifi);
    metadata.wifiMaxMsPerChannel = plan.channelDwellMs;
    metadata.wifiChannel = plan.channel;
    metadata.framePayloadCaptured = true;
    metadata.framePayloadBytes = capture.stats().payloadBytes;
    metadata.framePayloadRecords = capture.size();
    metadata.framePayloadSnapLength = plan.snapLength;
    metadata.framePayloadFormat = FramePayloadFormat::Ieee80211;
    metadata.appIdentity.fill(0xAB);
    metadata.appIdentityLength = metadata.appIdentity.size();
    CHECK(artifact.configureCaptureMetadata(metadata) ==
          CaptureMetadataStatus::Configured);
    CHECK(artifact.stop(2000000) == SessionStatus::Stopped);

    std::array<std::uint8_t, kSessionSegmentMaxBytes> segment{};
    std::array<std::uint8_t, kSessionManifestMaxBytes> manifest{};
    std::size_t segmentSize = 0;
    std::size_t manifestSize = 0;
    CHECK(encodeWifiFrameCaptureSegment(
              artifact, capture, segment.data(), segment.size(), &segmentSize) ==
          SessionCodecStatus::Valid);
    CHECK(encodeSessionManifest(
              artifact, segment.data(), segmentSize, manifest.data(),
              manifest.size(), &manifestSize) == SessionCodecStatus::Valid);
    SessionManifest decodedManifest;
    CHECK(decodeSessionManifest(manifest.data(), manifestSize,
                                &decodedManifest) == SessionCodecStatus::Valid);
    CHECK(decodedManifest.schemaVersion == kWifiFrameSessionSchemaVersion);
    SurveySession reopened;
    CHECK(reopenSession(manifest.data(), manifestSize, segment.data(),
                        segmentSize, &reopened) == SessionCodecStatus::Valid);
    CHECK(reopened.captureMetadata().framePayloadCaptured);
    CHECK(reopened.captureMetadata().framePayloadRecords == 2);
    std::array<char, 768> captureSummary{};
    CHECK(formatSessionJsonSummary(reopened, captureSummary.data(),
                                   captureSummary.size()));
    CHECK(std::strstr(captureSummary.data(), "leshy.capture.summary.v1") != nullptr);
    CHECK(std::strstr(captureSummary.data(), "\"frames\":2") != nullptr);
    PersistedWifiFrameCaptureView persisted;
    CHECK(openPersistedWifiFrameCapture(reopened, segment.data(), segmentSize,
                                        &persisted) == SessionCodecStatus::Valid);
    CHECK(persisted.frameCount() == capture.size());
    PcapMemorySink persistedSink;
    const PcapExportResult persistedPcap = writeRadiotapPcap(
        static_cast<const leshy1::domain::captures::WifiFrameSource&>(persisted),
        appendPcapBytes, &persistedSink);
    CHECK(persistedPcap.valid);
    CHECK(persistedSink.bytes == sink.bytes);
    segment[100] ^= 0x01U;
    CHECK(openPersistedWifiFrameCapture(reopened, segment.data(), segmentSize,
                                        &persisted) ==
          SessionCodecStatus::ChecksumMismatch);

    capture.reset();
    CHECK(capture.stats().state == WifiFrameCaptureState::Idle);
    CHECK(capture.size() == 0 && capture.frame(0) == nullptr);
}

class MemorySessionStoreIo final : public SessionStoreIo {
public:
    bool writeFile(const char* path, const std::uint8_t* data, std::size_t size) override {
        if (path == nullptr || (data == nullptr && size != 0)) return false;
        files[path] = std::vector<std::uint8_t>(data, data + size);
        return true;
    }

    ReadStatus readFile(const char* path, std::uint8_t* output, std::size_t capacity,
                        std::size_t* outputSize) override {
        if (path == nullptr || output == nullptr || outputSize == nullptr) {
            return ReadStatus::IoError;
        }
        const auto found = files.find(path);
        if (found == files.end()) return ReadStatus::NotFound;
        if (found->second.size() > capacity) return ReadStatus::TooLarge;
        std::memcpy(output, found->second.data(), found->second.size());
        *outputSize = found->second.size();
        return ReadStatus::Ok;
    }

    bool syncFile(const char*) override {
        if (failNextSync) {
            failNextSync = false;
            return false;
        }
        ++fileSyncs;
        return true;
    }
    bool syncDirectory() override {
        ++directorySyncs;
        return true;
    }

    std::map<std::string, std::vector<std::uint8_t>> files;
    std::size_t fileSyncs = 0;
    std::size_t directorySyncs = 0;
    bool failNextSync = false;
};

void testBoundedSessionStoreCommitsRecoversAndFallsBack() {
    char path[kSessionStorePathMax] = {};
    CHECK(formatSessionStorePath(StoreFileKind::Segment, 7, path, sizeof(path)));
    CHECK(std::strcmp(path, "segment-00000007.bin") == 0);
    CHECK(formatSessionStorePath(StoreFileKind::Manifest, UINT32_MAX, path, sizeof(path)));
    CHECK(std::strcmp(path, "manifest-4294967295.bin") == 0);
    char tooSmall[8] = {};
    CHECK(!formatSessionStorePath(StoreFileKind::Segment, 1, tooSmall, sizeof(tooSmall)));

    MemorySessionStoreIo io;
    SessionStoreWorkspace workspace;
    SurveySession reopened;
    SessionStoreRecoveryResult recovered = recoverSession(io, workspace, &reopened);
    CHECK(recovered.status == SessionStoreStatus::Empty);
    const SurveySession generationOne = goldenStoppedSession();
    SessionStoreCommitResult committed =
        commitNextSession(io, workspace, generationOne);
    CHECK(committed.complete());
    CHECK(committed.stage == CommitStage::Complete);
    CHECK(committed.publishedSlot == HeadSlot::A);
    recovered = recoverSession(io, workspace, &reopened);
    CHECK(recovered.valid());
    CHECK(recovered.choice == RecoveryChoice::A);
    CHECK(recovered.generation == 1);
    CHECK(recovered.observations == 3);
    CHECK(std::strcmp(reopened.id(), "golden-wifi-001") == 0);

    const SurveySession generationTwo = stoppedSessionWithId("golden-wifi-002", 4000);
    committed = commitNextSession(io, workspace, generationTwo);
    CHECK(committed.complete());
    recovered = recoverSession(io, workspace, &reopened);
    CHECK(recovered.valid());
    CHECK(recovered.choice == RecoveryChoice::B);
    CHECK(recovered.generation == 2);
    CHECK(std::strcmp(reopened.id(), "golden-wifi-002") == 0);
    CHECK(io.fileSyncs == 6);
    CHECK(io.directorySyncs == 6);

    std::vector<std::uint8_t>& newestSegment = io.files["segment-00000002.bin"];
    CHECK(!newestSegment.empty());
    newestSegment[0] ^= 1U;
    recovered = recoverSession(io, workspace, &reopened);
    CHECK(recovered.valid());
    CHECK(recovered.generation == 1);
    CHECK(recovered.bStatus == CandidateStatus::InvalidPayload);
    CHECK(std::strcmp(reopened.id(), "golden-wifi-001") == 0);
    newestSegment[0] ^= 1U;

