anton-vinogradov/esp32-leshy/tests/native/clean_target_tests.cpp
    const SessionStoreCommitResult full = commitNextSession(io, workspace, session);
    CHECK(!full.complete());
    CHECK(full.status == SessionStoreStatus::IoError);
    CHECK(full.stage == CommitStage::WritePayloads);
    recovered = recoverSession(io, workspace, &reopened);
    CHECK(recovered.valid());
    CHECK(recovered.generation == 2);

    io.reset();
    recovered = recoverSession(io, workspace, &reopened);
    CHECK(recovered.status == SessionStoreStatus::Empty);
}

void testGoldenSurveyTraceUsesListDetailBackAndExplicitStop() {
    SurveySession session;
    SurveyController controller(session);
    CHECK(controller.start("golden-wifi-001", 1000) == SessionStatus::Started);

    static constexpr std::array<std::array<std::uint8_t, 6>, 3> kBssids{{
        {0x02, 0x00, 0x00, 0x00, 0x00, 0x01},
        {0x02, 0x00, 0x00, 0x00, 0x00, 0x02},
        {0x02, 0x00, 0x00, 0x00, 0x00, 0x03},
    }};
    static constexpr std::array<std::uint8_t, 3> kChannels{{1, 6, 11}};
    static constexpr std::array<std::int16_t, 3> kRssi{{-71, -55, -83}};
    static constexpr std::array<const char*, 3> kSsids{{"alpha", "bravo", "charlie"}};

    for (std::size_t index = 0; index < kBssids.size(); ++index) {
        WifiScanRecord record;
        record.bssid = kBssids[index];
        record.channel = kChannels[index];
        record.rssiDbm = kRssi[index];
        record.ssid = kSsids[index];
        record.ssidLength = std::strlen(kSsids[index]);
        Observation observation;
        CHECK(normalizePassiveRecord(record, 2000 + index, &observation));
        CHECK(controller.publish(observation) == SessionStatus::Appended);
    }

    CHECK(controller.session().size() == 3);
    CHECK(controller.view() == SurveyView::List);
    CHECK(controller.selection() == 0);
    CHECK(controller.selected() != nullptr && controller.selected()->channel == 1);
    CHECK(controller.next());
    CHECK(controller.selected() != nullptr && controller.selected()->frequencyKhz == 2437000);
    CHECK(controller.openSelected());
    CHECK(controller.view() == SurveyView::Detail);
    CHECK(!controller.next());
    CHECK(controller.back());
    CHECK(controller.view() == SurveyView::List);
    CHECK(controller.session().state() == SessionState::Running);
    CHECK(!controller.back());
    CHECK(controller.stop(3000) == SessionStatus::Stopped);
    CHECK(controller.stop(3001) == SessionStatus::AlreadyStopped);
    CHECK(controller.session().size() == 3);
}

void testSurveyBrowserFiltersSourcesAndBuildsBoundedRssiHistory() {
    SurveySession session;
    SurveyController controller(session);
    CHECK(controller.start("browser-001", 1000) == SessionStatus::Started);

    const std::array<std::uint8_t, 6> wifiIdentity{{1, 2, 3, 4, 5, 6}};
    const std::array<std::uint8_t, 6> bleIdentity{{6, 5, 4, 3, 2, 1}};
    const auto append = [&](RadioKind radio,
                            const std::array<std::uint8_t, 6>& identity,
                            std::int16_t rssi, std::uint64_t atUs) {
        Observation observation;
        observation.monotonicUs = atUs;
        observation.radio = radio;
        observation.identity = identity;
        observation.identityLength = 6;
        observation.rssiDbm = rssi;
        CHECK(controller.publish(observation) == SessionStatus::Appended);
    };
    append(RadioKind::Wifi, wifiIdentity, -70, 1100);
    append(RadioKind::Ble, bleIdentity, -82, 1200);
    append(RadioKind::Wifi, wifiIdentity, -55, 1300);
    append(RadioKind::Ble, bleIdentity, -61, 1400);

    CHECK(controller.visibleSize() == 4);
    CHECK(controller.filter() == SurveyFilter::All);
    CHECK(std::strcmp(surveyViewName(controller.view()), "list") == 0);
    CHECK(std::strcmp(surveyFilterName(controller.filter()), "all") == 0);
    CHECK(controller.previous());
    CHECK(controller.filterFocused());
    CHECK(controller.selected() == nullptr);
    CHECK(controller.openSelected());
    CHECK(controller.view() == SurveyView::Filter);
    CHECK(controller.next());
    CHECK(controller.draftFilter() == SurveyFilter::Wifi);
    CHECK(controller.activateFilter());
    CHECK(controller.filter() == SurveyFilter::Wifi);
    CHECK(controller.visibleSize() == 2);
    CHECK(controller.filterFocused());
    CHECK(controller.next());
    CHECK(!controller.filterFocused());
    CHECK(controller.selected() != nullptr &&
          controller.selected()->radio == RadioKind::Wifi);
    ObservationHistory history = controller.selectedHistory();
    CHECK(history.valid);
    CHECK(history.sampleCount == 2);
    CHECK(history.retainedSamples == 2);
    CHECK(history.minimumRssiDbm == -70);
    CHECK(history.maximumRssiDbm == -55);
    CHECK(history.latestRssiDbm == -55);
    CHECK(history.samples[0] == -70 && history.samples[1] == -55);

    CHECK(controller.previous());
    CHECK(controller.filterFocused());
    CHECK(controller.openSelected());
    CHECK(controller.next());
    CHECK(controller.draftFilter() == SurveyFilter::Ble);
    CHECK(controller.activateFilter());
    CHECK(controller.visibleSize() == 2);
    CHECK(controller.next());
    CHECK(controller.openSelected());
    CHECK(controller.view() == SurveyView::Detail);
    history = controller.selectedHistory();
    CHECK(history.valid && history.sampleCount == 2);
    CHECK(history.minimumRssiDbm == -82);
    CHECK(history.maximumRssiDbm == -61);
    CHECK(history.latestRssiDbm == -61);
    CHECK(controller.back());
    CHECK(controller.view() == SurveyView::List);
}

void testSurveySourcePlanProjectsAvailabilityAndRequiresSelection() {
    HardwareInventory inventory;
    CHECK(inventory.add({"radio.wifi", CapabilityState::Declared,
                         "builtin", "driver_not_started"}));
    CHECK(inventory.add({"survey.persistent_passive",
                         CapabilityState::Available, "worker",
                         "wifi_worker_ready"}));
    CHECK(inventory.add({"radio.ble", CapabilityState::Declared,
                         "builtin", "driver_not_implemented"}));

    SurveySourceController controller;
    controller.rebuild(inventory);
    CHECK(controller.view() == SurveySetupView::Plan);
    CHECK(controller.selection() == 0);
    CHECK(controller.selectedCount() == 1);
    CHECK(controller.selectedMask() == 1);
    CHECK(controller.canStart());
    const SurveySourceOption* wifi = controller.find(SurveySourceKind::Wifi);
    const SurveySourceOption* ble = controller.find(SurveySourceKind::Ble);
    CHECK(wifi != nullptr && wifi->available() && wifi->selected);
    CHECK(wifi != nullptr && std::strcmp(wifi->reason, "wifi_worker_ready") == 0);
    CHECK(ble != nullptr && !ble->available() && !ble->selected);
    CHECK(ble != nullptr &&
          std::strcmp(ble->reason, "driver_not_implemented") == 0);

    CHECK(controller.activate() == SurveySetupActivation::OpenedSources);
    CHECK(controller.view() == SurveySetupView::Sources);
    CHECK(controller.activate() == SurveySetupActivation::SourceChanged);
    CHECK(!controller.canStart());
    CHECK(controller.next());
    CHECK(controller.activate() == SurveySetupActivation::SourceUnavailable);
    CHECK(controller.selectedMask() == 0);
    CHECK(controller.back());
    CHECK(controller.view() == SurveySetupView::Plan);
    CHECK(controller.next());
    CHECK(controller.activate() == SurveySetupActivation::OpenedSpectrum);
    CHECK(controller.next());
    CHECK(controller.activate() == SurveySetupActivation::StartBlocked);
    CHECK(controller.previous());
    CHECK(controller.previous());
    CHECK(controller.activate() == SurveySetupActivation::OpenedSources);
    CHECK(controller.activate() == SurveySetupActivation::SourceChanged);
    CHECK(controller.back());
    CHECK(controller.next());
    CHECK(controller.activate() == SurveySetupActivation::OpenedSpectrum);
    CHECK(controller.next());
    CHECK(controller.activate() == SurveySetupActivation::StartRequested);

