anton-vinogradov/esp32-leshy/tests/native/clean_target_tests.cpp
    RecoveryResult recovery = recoverHead(candidate(aWire, a), candidate(bWire, b));
    CHECK(recovery.choice == RecoveryChoice::B);
    CHECK(recovery.selected.generation == 11);

    recovery = recoverHead(candidate(aWire, a), candidate(bWire, b, false));
    CHECK(recovery.choice == RecoveryChoice::A);
    CHECK(recovery.bStatus == CandidateStatus::MissingManifest);
    recovery = recoverHead(candidate(aWire, a), candidate(bWire, b, true, false));
    CHECK(recovery.choice == RecoveryChoice::A);
    CHECK(recovery.bStatus == CandidateStatus::ManifestMismatch);

    const HeadRecord conflicting{10, 1400, 0xABCDEF01U};
    CHECK(encodeHead(conflicting, bWire, sizeof(bWire)));
    recovery = recoverHead(candidate(aWire, a), candidate(bWire, conflicting));
    CHECK(recovery.choice == RecoveryChoice::Conflict);

    const HeadRecord wrapped{0, 100, 1};
    const HeadRecord beforeWrap{0xFFFFFFFFU, 100, 1};
    CHECK(encodeHead(wrapped, aWire, sizeof(aWire)));
    CHECK(encodeHead(beforeWrap, bWire, sizeof(bWire)));
    recovery = recoverHead(candidate(aWire, wrapped), candidate(bWire, beforeWrap));
    CHECK(recovery.choice == RecoveryChoice::A);

    const HeadRecord ambiguous{0x80000000U, 100, 1};
    CHECK(encodeHead(ambiguous, aWire, sizeof(aWire)));
    const HeadRecord zero{0, 100, 1};
    CHECK(encodeHead(zero, bWire, sizeof(bWire)));
    recovery = recoverHead(candidate(aWire, ambiguous), candidate(bWire, zero));
    CHECK(recovery.choice == RecoveryChoice::Conflict);
}

class FaultBackend final : public CommitBackend {
public:
    explicit FaultBackend(CommitStage failure) : failure_(failure) {
        encodeHead(oldB_, persistedB_, sizeof(persistedB_));
    }

    bool writePayloads() override { return succeeds(CommitStage::WritePayloads); }
    bool syncPayloads() override { return succeeds(CommitStage::SyncPayloads); }
    bool writeManifest() override { return succeeds(CommitStage::WriteManifest); }
    bool syncManifest() override {
        if (!succeeds(CommitStage::SyncManifest)) return false;
        newManifestSynced_ = true;
        return true;
    }
    bool writeOlderHead(const std::uint8_t* wire, std::size_t size) override {
        if (size != kHeadWireSize) return false;
        std::memcpy(pending_, wire, size);
        if (failure_ == CommitStage::WriteHead) {
            std::memcpy(persistedB_, pending_, kHeadWireSize / 2);
            return false;
        }
        return true;
    }
    bool syncHead() override {
        if (failure_ == CommitStage::SyncHead) {
            std::memcpy(persistedB_, pending_, kHeadWireSize / 2);
            return false;
        }
        std::memcpy(persistedB_, pending_, kHeadWireSize);
        return true;
    }

    HeadCandidate bCandidate(const HeadRecord& next) const {
        HeadRecord decoded;
        if (decodeHead(persistedB_, sizeof(persistedB_), &decoded) != HeadDecodeStatus::Valid) {
            return {persistedB_, sizeof(persistedB_), {false, 0, 0}};
        }
        if (decoded.generation == next.generation && newManifestSynced_) {
            return candidate(persistedB_, next);
        }
        return candidate(persistedB_, oldB_);
    }

private:
    bool succeeds(CommitStage stage) const { return failure_ != stage; }

    CommitStage failure_;
    bool newManifestSynced_ = false;
    const HeadRecord oldB_{9, 900, 0x09090909U};
    std::uint8_t pending_[kHeadWireSize] = {};
    std::uint8_t persistedB_[kHeadWireSize] = {};
};

void testEveryCommitBoundaryPreservesAValidGeneration() {
    const HeadRecord current{10, 1000, 0x10101010U};
    const HeadRecord next{11, 1100, 0x11111111U};
    std::uint8_t currentWire[kHeadWireSize] = {};
    CHECK(encodeHead(current, currentWire, sizeof(currentWire)));
    static constexpr CommitStage kFailureStages[] = {
        CommitStage::WritePayloads, CommitStage::SyncPayloads, CommitStage::WriteManifest,
        CommitStage::SyncManifest, CommitStage::WriteHead, CommitStage::SyncHead};

    for (CommitStage stage : kFailureStages) {
        FaultBackend backend(stage);
        const CommitResult result = commitGeneration(backend, next);
        CHECK(!result.complete);
        CHECK(result.stage == stage);
        const RecoveryResult recovery =
            recoverHead(candidate(currentWire, current), backend.bCandidate(next));
        CHECK(recovery.choice == RecoveryChoice::A);
        CHECK(recovery.selected.generation == current.generation);
    }

    FaultBackend backend(CommitStage::Complete);
    const CommitResult result = commitGeneration(backend, next);
    CHECK(result.complete);
    CHECK(result.stage == CommitStage::Complete);
    const RecoveryResult recovery =
        recoverHead(candidate(currentWire, current), backend.bCandidate(next));
    CHECK(recovery.choice == RecoveryChoice::B);
    CHECK(recovery.selected.generation == next.generation);
}

void testStorageWritesRequireExactDisposableScope() {
    const MediaIdentity media{true, MediaKind::Sd, "CID-A1B2C3", 16U * 1024U * 1024U,
                              12U * 1024U * 1024U};
    const WriteRequest valid{true, "CID-A1B2C3", "run_20260816", false,
                             2U * 1024U * 1024U, 2U * 1024U * 1024U};
    WritePermit permit = authorizeScratchWrite(media, valid);
    CHECK(permit.allowed());
    CHECK(permit.status == PermitStatus::Permitted);
    CHECK(std::strcmp(permit.scratchPath, "/leshy-hil/run_20260816") == 0);
    CHECK(permit.byteLimit == valid.requiredBytes);

    MediaIdentity changedMedia = media;
    changedMedia.present = false;
    CHECK(authorizeScratchWrite(changedMedia, valid).status == PermitStatus::MissingMedia);

    WriteRequest changed = valid;
    changed.explicitlyDisposable = false;
    CHECK(authorizeScratchWrite(media, changed).status ==
          PermitStatus::ExplicitAuthorizationRequired);
    changed = valid;
    changed.expectedFingerprint = "CID/INVALID";
    CHECK(authorizeScratchWrite(media, changed).status == PermitStatus::InvalidFingerprint);
    changed = valid;
    changed.expectedFingerprint = "CID-DIFFERENT";
    CHECK(authorizeScratchWrite(media, changed).status == PermitStatus::FingerprintMismatch);
    changed = valid;
    changed.runId = "../escape";
    CHECK(authorizeScratchWrite(media, changed).status == PermitStatus::InvalidRunId);
    changed = valid;
    changed.scratchExists = true;
    CHECK(authorizeScratchWrite(media, changed).status == PermitStatus::ScratchAlreadyExists);
    changed = valid;
    changed.requiredBytes = 0;
    CHECK(authorizeScratchWrite(media, changed).status == PermitStatus::InvalidSize);
    changed = valid;
    changed.reserveBytes = UINT64_MAX;
    CHECK(authorizeScratchWrite(media, changed).status == PermitStatus::InvalidSize);
    changed = valid;
    changed.requiredBytes = 11U * 1024U * 1024U;
    CHECK(authorizeScratchWrite(media, changed).status == PermitStatus::InsufficientSpace);

    changedMedia = media;
    changedMedia.capacityBytes = changedMedia.freeBytes - 1U;
    CHECK(authorizeScratchWrite(changedMedia, valid).status == PermitStatus::InsufficientSpace);
    CHECK(std::strcmp(permitStatusName(PermitStatus::FingerprintMismatch),
                      "fingerprint_mismatch") == 0);

    ExistingScratchReadRequest readRequest;
    readRequest.explicitlySelected = true;
    readRequest.expectedFingerprint = "CID-A1B2C3";
    readRequest.runId = "run_20260816";
    readRequest.scratchExists = true;
    ReadPermit readPermit = authorizeExistingScratchRead(media, readRequest);
    CHECK(readPermit.allowed());
    CHECK(std::strcmp(readPermit.scratchPath,
                      "/leshy-hil/run_20260816") == 0);
    ExistingScratchReadRequest changedRead = readRequest;
    changedRead.explicitlySelected = false;
    CHECK(authorizeExistingScratchRead(media, changedRead).status ==
          ReadPermitStatus::ExplicitAuthorizationRequired);
    changedRead = readRequest;
    changedRead.expectedFingerprint = "CID-DIFFERENT";
    CHECK(authorizeExistingScratchRead(media, changedRead).status ==
          ReadPermitStatus::FingerprintMismatch);
    changedRead = readRequest;
    changedRead.runId = "../escape";
    CHECK(authorizeExistingScratchRead(media, changedRead).status ==
          ReadPermitStatus::InvalidRunId);
    changedRead = readRequest;
    changedRead.scratchExists = false;
    CHECK(authorizeExistingScratchRead(media, changedRead).status ==
          ReadPermitStatus::ScratchMissing);
    CHECK(std::strcmp(readPermitStatusName(ReadPermitStatus::ScratchMissing),
                      "scratch_missing") == 0);
}

class FakeReadOnlyMediaAdapter final : public ReadOnlyMediaAdapter {
public:
    explicit FakeReadOnlyMediaAdapter(MediaDiscovery discovery) : discovery_(discovery) {}
    MediaDiscovery discoverReadOnly() override { return discovery_; }

