anton-vinogradov/esp32-leshy/tests/native/clean_target_tests.cpp
private:
    MediaDiscovery discovery_;
};

void testMediaDiscoveryBoundaryIsReadOnlyAndFailClosed() {
    MediaDiscovery boardLike;
    boardLike.kind = MediaKind::Sd;
    boardLike.status = MediaDiscoveryStatus::Unknown;
    boardLike.slotDeclared = true;
    boardLike.detectPin = 38;
    boardLike.detectSampled = true;
    boardLike.detectLevel = 1;
    boardLike.detectAuthoritative = false;
    boardLike.reason = "polarity_unverified_no_mount";
    FakeReadOnlyMediaAdapter adapter(boardLike);
    const MediaDiscovery discovered = adapter.discoverReadOnly();
    CHECK(validateMediaDiscovery(discovered) == MediaDiscoveryValidation::Valid);
    char report[768] = {};
    CHECK(formatMediaDiscoveryJson(discovered, report, sizeof(report)));
    CHECK(std::strcmp(
              report,
              "{\"schema\":\"leshy.storage.discovery.v1\",\"kind\":\"report\","
              "\"validation\":\"valid\",\"media_kind\":\"sd\","
              "\"status\":\"unknown\",\"slot_declared\":true,\"detect_pin\":38,"
              "\"detect_sampled\":true,\"detect_level\":1,"
              "\"detect_authoritative\":false,\"mount_attempted\":false,"
              "\"mounted_read_only\":false,\"filesystem\":\"unknown\","
              "\"fingerprint\":null,\"capacity_bytes\":0,\"free_bytes\":0,"
              "\"write_enabled\":false,\"guard_required\":true,"
              "\"reason\":\"polarity_unverified_no_mount\"}") == 0);

    MediaDiscovery detected = boardLike;
    detected.status = MediaDiscoveryStatus::Detected;
    detected.detectAuthoritative = true;
    detected.mountAttempted = true;
    detected.mountedReadOnly = true;
    detected.filesystem = FilesystemKind::Fat;
    detected.fingerprint = "CID-A1B2C3";
    detected.capacityBytes = 16U * 1024U * 1024U;
    detected.freeBytes = 12U * 1024U * 1024U;
    detected.reason = "read_only_mount_valid";
    CHECK(validateMediaDiscovery(detected) == MediaDiscoveryValidation::Valid);
    CHECK(formatMediaDiscoveryJson(detected, report, sizeof(report)));
    CHECK(std::strstr(report, "\"fingerprint\":\"CID-A1B2C3\"") != nullptr);

    MediaDiscovery invalid = detected;
    invalid.writeEnabled = true;
    CHECK(validateMediaDiscovery(invalid) == MediaDiscoveryValidation::WriteEnabled);
    invalid = detected;
    invalid.detectAuthoritative = false;
    CHECK(validateMediaDiscovery(invalid) ==
          MediaDiscoveryValidation::UnauthoritativePresenceClaim);
    invalid = detected;
    invalid.mountAttempted = false;
    CHECK(validateMediaDiscovery(invalid) == MediaDiscoveryValidation::MountStateInvalid);
    invalid = detected;
    invalid.fingerprint = nullptr;
    CHECK(validateMediaDiscovery(invalid) ==
          MediaDiscoveryValidation::DetectedMetadataMissing);
    invalid = detected;
    invalid.freeBytes = invalid.capacityBytes + 1;
    CHECK(validateMediaDiscovery(invalid) == MediaDiscoveryValidation::CapacityInvalid);
    invalid = boardLike;
    invalid.detectLevel = -1;
    CHECK(validateMediaDiscovery(invalid) ==
          MediaDiscoveryValidation::InvalidDetectSample);
    invalid = boardLike;
    invalid.reason = "invalid reason";
    CHECK(validateMediaDiscovery(invalid) == MediaDiscoveryValidation::InvalidReason);
    CHECK(!formatMediaDiscoveryJson(invalid, report, sizeof(report)));
    CHECK(report[0] == '\0');
    CHECK(std::strcmp(mediaDiscoveryValidationName(
                          MediaDiscoveryValidation::UnauthoritativePresenceClaim),
                      "unauthoritative_presence_claim") == 0);
}

void testReadOnlyMountAuthorizationRequiresSelectionDriverAndLeases() {
    MediaDiscovery discovery;
    discovery.kind = MediaKind::Sd;
    discovery.status = MediaDiscoveryStatus::Unknown;
    discovery.slotDeclared = true;
    discovery.detectPin = 38;
    discovery.detectSampled = true;
    discovery.detectLevel = 0;
    discovery.detectAuthoritative = false;
    discovery.reason = "polarity_unverified_no_mount";
    const ResourceMask required = resourceMask(Resource::Storage) |
                                  resourceMask(Resource::RadioSpi);
    ReadOnlyMountRequest request;
    request.explicitlySelected = true;
    request.driverReadOnlyGuaranteed = true;
    request.ownedResources = required;
    ReadOnlyMountPermit permit = authorizeReadOnlyMountAttempt(discovery, request);
    CHECK(permit.allowed());
    CHECK(permit.requiredResources == required);

    ReadOnlyMountRequest changed = request;
    changed.explicitlySelected = false;
    CHECK(authorizeReadOnlyMountAttempt(discovery, changed).status ==
          ReadOnlyMountStatus::ExplicitTargetRequired);
    changed = request;
    changed.driverReadOnlyGuaranteed = false;
    CHECK(authorizeReadOnlyMountAttempt(discovery, changed).status ==
          ReadOnlyMountStatus::DriverNotReadOnly);
    changed = request;
    changed.formatRequested = true;
    CHECK(authorizeReadOnlyMountAttempt(discovery, changed).status ==
          ReadOnlyMountStatus::FormatForbidden);
    changed = request;
    changed.ownedResources = resourceMask(Resource::Storage);
    CHECK(authorizeReadOnlyMountAttempt(discovery, changed).status ==
          ReadOnlyMountStatus::ResourcesMissing);
    changed = request;
    changed.conflictingOwner = true;
    CHECK(authorizeReadOnlyMountAttempt(discovery, changed).status ==
          ReadOnlyMountStatus::ResourceConflict);

    MediaDiscovery changedDiscovery = discovery;
    changedDiscovery.mountAttempted = true;
    CHECK(authorizeReadOnlyMountAttempt(changedDiscovery, request).status ==
          ReadOnlyMountStatus::AlreadyAttempted);
    changedDiscovery = discovery;
    changedDiscovery.slotDeclared = false;
    CHECK(authorizeReadOnlyMountAttempt(changedDiscovery, request).status ==
          ReadOnlyMountStatus::SlotUnavailable);
    changedDiscovery = discovery;
    changedDiscovery.reason = nullptr;
    CHECK(authorizeReadOnlyMountAttempt(changedDiscovery, request).status ==
          ReadOnlyMountStatus::InvalidDiscovery);
    CHECK(std::strcmp(readOnlyMountStatusName(ReadOnlyMountStatus::DriverNotReadOnly),
                      "driver_not_read_only") == 0);
}

void testSdIdentificationProtocolCannotDriftIntoWrites() {
    SdReadOnlyPlan plan = defaultSdIdentificationPlan();
    CHECK(validateSdIdentificationPlan(plan) == SdReadOnlyPlanStatus::Valid);
    char report[512] = {};
    CHECK(formatSdReadOnlyProtocolJson(plan, report, sizeof(report)));
    CHECK(std::strstr(report, "\"commands\":[0,8,55,41,58,10,9]") != nullptr);
    CHECK(std::strstr(report, "\"write_commands\":false") != nullptr);
    CHECK(std::strstr(report, "\"execution_enabled\":false") != nullptr);

    static constexpr std::array<std::uint8_t, 11> kMutatingCommands{
        24, 25, 26, 27, 28, 29, 32, 33, 38, 42, 56};
    for (const std::uint8_t command : kMutatingCommands) {
        SdReadOnlyPlan changed = plan;
        changed.commands[3] = command;
        CHECK(isMutatingSdCommand(command));
        CHECK(validateSdIdentificationPlan(changed) ==
              SdReadOnlyPlanStatus::MutatingCommand);
    }
    SdReadOnlyPlan changed = plan;
    changed.commandCount = plan.commandCount - 1;
    CHECK(validateSdIdentificationPlan(changed) == SdReadOnlyPlanStatus::InvalidCount);
    changed = plan;
    changed.commands[1] = 13;
    CHECK(validateSdIdentificationPlan(changed) ==
          SdReadOnlyPlanStatus::InvalidSequence);
    changed = plan;
    changed.maxInitAttempts = 0;
    CHECK(validateSdIdentificationPlan(changed) ==
          SdReadOnlyPlanStatus::InvalidInitBound);
    changed = plan;
    changed.maxInitAttempts = kSdMaxInitAttempts + 1;
    CHECK(validateSdIdentificationPlan(changed) ==
          SdReadOnlyPlanStatus::InvalidInitBound);
    changed = plan;
    changed.executionEnabled = true;
    CHECK(validateSdIdentificationPlan(changed) ==
          SdReadOnlyPlanStatus::ExecutionEnabled);
    CHECK(!formatSdReadOnlyProtocolJson(changed, report, sizeof(report)));
    CHECK(report[0] == '\0');
}

void testSdIdentificationParserRejectsTranscriptFaults() {
    const SdReadOnlyPlan plan = defaultSdIdentificationPlan();
    const SdIdentificationTranscript golden = goldenSdIdentificationTranscript();
    SdIdentity identity;
    CHECK(parseSdIdentification(plan, golden, &identity) == SdIdentificationStatus::Valid);
    CHECK(identity.capacityBytes == 16U * 1024U * 1024U);
    CHECK(identity.highCapacity);
    CHECK(identity.initAttempts == 3);
    const std::uint8_t crcVector[] = {'1', '2', '3', '4', '5', '6', '7', '8', '9'};
    CHECK(sdCrc16(crcVector, sizeof(crcVector)) == 0x31C3U);
    char report[640] = {};
    CHECK(formatSdIdentificationJson(identity, report, sizeof(report)));
    CHECK(std::strstr(report, "\"transport\":\"golden_fake\"") != nullptr);
    CHECK(std::strstr(report, "\"physical_spi_executed\":false") != nullptr);
    CHECK(std::strstr(report, "\"capacity_bytes\":16777216") != nullptr);

    for (std::size_t byte = 0; byte < golden.cid.size(); ++byte) {
        for (std::uint8_t bit = 0; bit < 8; ++bit) {
            SdIdentificationTranscript changed = golden;
            changed.cid[byte] ^= static_cast<std::uint8_t>(1U << bit);
            CHECK(parseSdIdentification(plan, changed, &identity) ==
                  SdIdentificationStatus::CidChecksumInvalid);
        }
    }
    for (std::size_t byte = 0; byte < golden.csd.size(); ++byte) {
        for (std::uint8_t bit = 0; bit < 8; ++bit) {
            SdIdentificationTranscript changed = golden;
            changed.csd[byte] ^= static_cast<std::uint8_t>(1U << bit);
            CHECK(parseSdIdentification(plan, changed, &identity) ==
                  SdIdentificationStatus::CsdChecksumInvalid);
        }
    }

    SdIdentificationTranscript changed = golden;
    changed.cmd0R1 = 0;
    CHECK(parseSdIdentification(plan, changed, &identity) ==
          SdIdentificationStatus::ResponseInvalid);
    changed = golden;
    changed.cmd8Echo = 0;
    CHECK(parseSdIdentification(plan, changed, &identity) ==
          SdIdentificationStatus::VoltageEchoInvalid);
    changed = golden;
    changed.initAttempts = plan.maxInitAttempts + 1;
    CHECK(parseSdIdentification(plan, changed, &identity) ==
          SdIdentificationStatus::InitAttemptsInvalid);
    changed = golden;
    changed.ocr = 0;
    CHECK(parseSdIdentification(plan, changed, &identity) ==
          SdIdentificationStatus::OcrInvalid);
    changed = golden;
    changed.cid.fill(0);
    changed.cidCrc16 = sdCrc16(changed.cid.data(), changed.cid.size());
    CHECK(parseSdIdentification(plan, changed, &identity) ==
          SdIdentificationStatus::CidInvalid);
    changed = golden;
    changed.csd[0] = 0;
    changed.csdCrc16 = sdCrc16(changed.csd.data(), changed.csd.size());
    CHECK(parseSdIdentification(plan, changed, &identity) ==
          SdIdentificationStatus::CsdUnsupported);
    SdReadOnlyPlan invalidPlan = plan;
    invalidPlan.executionEnabled = true;
    CHECK(parseSdIdentification(invalidPlan, golden, &identity) ==
          SdIdentificationStatus::InvalidPlan);
}

void testSdIdentificationStateMachineIsBoundedAndFakeOnly() {
    const SdReadOnlyPlan plan = defaultSdIdentificationPlan();
    GoldenFakeSdTransport golden;
    const SdTransportRunResult result = runSdIdentificationStateMachine(plan, golden);
    CHECK(result.status == SdTransportRunStatus::Valid);
    CHECK(result.parseStatus == SdIdentificationStatus::Valid);
    CHECK(result.commandsAttempted == 11);
    CHECK(result.commandsCompleted == 11);
    CHECK(result.identity.initAttempts == 3);
    CHECK(result.identity.capacityBytes == 16U * 1024U * 1024U);
    CHECK(golden.exchanges() == 11);
    CHECK(!golden.sequenceViolation());
    char report[512] = {};
    CHECK(formatSdTransportRunJson(result, report, sizeof(report)));
    CHECK(std::strstr(report, "\"transport\":\"golden_fake\"") != nullptr);
    CHECK(std::strstr(report, "\"commands_completed\":11") != nullptr);
    CHECK(std::strstr(report, "\"physical_spi_executed\":false") != nullptr);

    for (std::uint16_t failure = 1; failure <= 11; ++failure) {
        GoldenFakeSdTransport failing(3, failure);
        const SdTransportRunResult failed =
            runSdIdentificationStateMachine(plan, failing);
        CHECK(failed.status == SdTransportRunStatus::ExchangeFailed);
        CHECK(failed.commandsAttempted == failure);
        CHECK(failed.commandsCompleted == failure - 1);
    }

    GoldenFakeSdTransport neverReady(kSdMaxInitAttempts + 1);
    const SdTransportRunResult timedOut =
        runSdIdentificationStateMachine(plan, neverReady);
    CHECK(timedOut.status == SdTransportRunStatus::InitTimeout);
    CHECK(timedOut.commandsAttempted == 2 + 2 * kSdMaxInitAttempts);
    CHECK(timedOut.commandsCompleted == timedOut.commandsAttempted);

    SdReadOnlyPlan invalidPlan = plan;
    invalidPlan.commands[0] = 24;
    GoldenFakeSdTransport unused;
    CHECK(runSdIdentificationStateMachine(invalidPlan, unused).status ==
          SdTransportRunStatus::InvalidPlan);
    CHECK(unused.exchanges() == 0);

    class PhysicalStub final : public SdIdentificationTransport {
    public:
        bool isPhysical() const override { return true; }
        bool exchange(std::uint8_t, std::uint32_t, SdCommandResponse*) override {
            ++calls;
            return true;
        }
        std::uint16_t calls = 0;
    } physical;
    CHECK(runSdIdentificationStateMachine(plan, physical).status ==
          SdTransportRunStatus::PhysicalTransportRejected);
    CHECK(physical.calls == 0);

    class PhysicalGolden final : public SdIdentificationTransport {
    public:
        bool isPhysical() const override { return true; }
        bool exchange(std::uint8_t command, std::uint32_t argument,
                      SdCommandResponse* response) override {
            return fake.exchange(command, argument, response);
        }
        GoldenFakeSdTransport fake;
    } permittedPhysical;
    SdTransportRunPolicy policy;
    policy.allowPhysical = true;
    CHECK(runSdIdentificationStateMachine(plan, permittedPhysical, policy).status ==
          SdTransportRunStatus::PhysicalTargetRequired);
    CHECK(permittedPhysical.fake.exchanges() == 0);
    policy.explicitlySelected = true;
    CHECK(runSdIdentificationStateMachine(plan, permittedPhysical, policy).status ==
          SdTransportRunStatus::ReadOnlyContractRequired);
    CHECK(permittedPhysical.fake.exchanges() == 0);
    policy.identificationOnly = true;
    CHECK(runSdIdentificationStateMachine(plan, permittedPhysical, policy).status ==
          SdTransportRunStatus::ResourcesMissing);
    CHECK(permittedPhysical.fake.exchanges() == 0);
    policy.ownedResources = kSdIdentificationResources;
    policy.conflictingOwner = true;
    CHECK(runSdIdentificationStateMachine(plan, permittedPhysical, policy).status ==
          SdTransportRunStatus::ResourceConflict);
    CHECK(permittedPhysical.fake.exchanges() == 0);
    policy.conflictingOwner = false;
    const SdTransportRunResult physicalResult =
        runSdIdentificationStateMachine(plan, permittedPhysical, policy);
    CHECK(physicalResult.status == SdTransportRunStatus::Valid);
    CHECK(physicalResult.physicalTransport);
    CHECK(permittedPhysical.fake.exchanges() == 11);
    CHECK(formatSdTransportRunJson(physicalResult, report, sizeof(report)));
    CHECK(std::strstr(report, "\"transport\":\"physical_spi\"") != nullptr);
    CHECK(std::strstr(report, "\"physical_spi_executed\":true") != nullptr);

