anton-vinogradov/esp32-leshy/tests/native/clean_target_tests.cpp
    GoldenFakeSdTransport wrongSequence;
    SdCommandResponse response;
    CHECK(!wrongSequence.exchange(1, 0, &response));
    CHECK(wrongSequence.sequenceViolation());
}

void testSdSpiWireCodecIsBoundedAndReadOnly() {
    const SdReadOnlyPlan plan = defaultSdIdentificationPlan();
    SdCommandFrame frame;
    CHECK(encodeSdIdentificationCommand(plan, 0, 0, &frame) == SdWireStatus::Valid);
    const std::array<std::uint8_t, 6> expectedCmd0{0x40, 0, 0, 0, 0, 0x95};
    CHECK(frame.bytes == expectedCmd0);
    CHECK(encodeSdIdentificationCommand(plan, 8, 0x1AAU, &frame) ==
          SdWireStatus::Valid);
    const std::array<std::uint8_t, 6> expectedCmd8{0x48, 0, 0, 0x01, 0xAA, 0x87};
    CHECK(frame.bytes == expectedCmd8);
    CHECK(sdCrc7(expectedCmd0.data(), 5) == 0x4AU);
    CHECK(sdCrc7(expectedCmd8.data(), 5) == 0x43U);
    CHECK(encodeSdIdentificationCommand(plan, 8, 0, &frame) ==
          SdWireStatus::ArgumentInvalid);
    static constexpr std::array<std::uint8_t, 11> kMutatingCommands{
        24, 25, 26, 27, 28, 29, 32, 33, 38, 42, 56};
    for (const std::uint8_t command : kMutatingCommands) {
        CHECK(encodeSdIdentificationCommand(plan, command, 0, &frame) ==
              SdWireStatus::CommandNotAllowed);
    }
    SdReadOnlyPlan invalidPlan = plan;
    invalidPlan.executionEnabled = true;
    CHECK(encodeSdIdentificationCommand(invalidPlan, 0, 0, &frame) ==
          SdWireStatus::InvalidPlan);

    class VectorByteSource final : public SdByteSource {
    public:
        explicit VectorByteSource(std::vector<std::uint8_t> input)
            : input_(std::move(input)) {}
        bool readByte(std::uint8_t* value) override {
            if (value == nullptr || offset_ >= input_.size()) return false;
            *value = input_[offset_++];
            return true;
        }
    private:
        std::vector<std::uint8_t> input_;
        std::size_t offset_ = 0;
    };

    std::uint8_t r1 = 0xFF;
    VectorByteSource delayedR1({0xFF, 0xFF, 0x01});
    CHECK(readSdR1(delayedR1, 3, &r1) == SdWireStatus::Valid);
    CHECK(r1 == 0x01);
    VectorByteSource timeoutR1(std::vector<std::uint8_t>(kSdMaxR1PollBytes, 0xFF));
    CHECK(readSdR1(timeoutR1, kSdMaxR1PollBytes, &r1) ==
          SdWireStatus::ResponseTimeout);
    VectorByteSource invalidR1({0x80});
    CHECK(readSdR1(invalidR1, 1, &r1) == SdWireStatus::ResponseInvalid);
    VectorByteSource noR1({});
    CHECK(readSdR1(noR1, 1, &r1) == SdWireStatus::IoError);
    VectorByteSource unusedR1({0x01});
    CHECK(readSdR1(unusedR1, 0, &r1) == SdWireStatus::InvalidBound);

    VectorByteSource trailing({0x12, 0x34, 0x56, 0x78});
    std::uint32_t trailingValue = 0;
    CHECK(readSdTrailing32(trailing, &trailingValue) == SdWireStatus::Valid);
    CHECK(trailingValue == 0x12345678U);
    VectorByteSource shortTrailing({0x12, 0x34, 0x56});
    CHECK(readSdTrailing32(shortTrailing, &trailingValue) == SdWireStatus::IoError);

    const SdIdentificationTranscript golden = goldenSdIdentificationTranscript();
    std::vector<std::uint8_t> dataFrame{0xFF, 0xFE};
    dataFrame.insert(dataFrame.end(), golden.cid.begin(), golden.cid.end());
    dataFrame.push_back(static_cast<std::uint8_t>(golden.cidCrc16 >> 8U));
    dataFrame.push_back(static_cast<std::uint8_t>(golden.cidCrc16));
    VectorByteSource validData(dataFrame);
    std::array<std::uint8_t, 16> decoded{};
    std::uint16_t receivedCrc = 0;
    CHECK(readSdData16(validData, 2, &decoded, &receivedCrc) == SdWireStatus::Valid);
    CHECK(decoded == golden.cid);
    CHECK(receivedCrc == golden.cidCrc16);
    dataFrame[2] ^= 1U;
    VectorByteSource corruptData(dataFrame);
    CHECK(readSdData16(corruptData, 2, &decoded, &receivedCrc) ==
          SdWireStatus::DataChecksumInvalid);
    VectorByteSource invalidToken({0x00});
    CHECK(readSdData16(invalidToken, 1, &decoded, &receivedCrc) ==
          SdWireStatus::DataTokenInvalid);
    VectorByteSource tokenTimeout(
        std::vector<std::uint8_t>(kSdMaxDataTokenPollBytes, 0xFF));
    CHECK(readSdData16(tokenTimeout, kSdMaxDataTokenPollBytes, &decoded,
                       &receivedCrc) == SdWireStatus::DataTokenTimeout);

    char report[512] = {};
    CHECK(formatSdWireContractJson(report, sizeof(report)));
    CHECK(std::strstr(report, "\"cmd0_frame\":\"400000000095\"") != nullptr);
    CHECK(std::strstr(report, "\"cmd8_frame\":\"48000001AA87\"") != nullptr);
    CHECK(std::strstr(report, "\"physical_spi_executed\":false") != nullptr);
}

void testSdSector0ReadIsSingleBoundedAndParseOnly() {
    SdSectorReadRequest request;
    CHECK(authorizeSdSector0Read(request) ==
          SdSectorReadStatus::ExplicitTargetRequired);
    request.explicitlySelected = true;
    CHECK(authorizeSdSector0Read(request) == SdSectorReadStatus::ReadOnlyRequired);
    request.readOnly = true;
    CHECK(authorizeSdSector0Read(request) ==
          SdSectorReadStatus::HighCapacityRequired);
    request.highCapacity = true;
    CHECK(authorizeSdSector0Read(request) == SdSectorReadStatus::CapacityInvalid);
    request.capacityBytes = 64ULL * 1024U * 1024U;
    request.lba = 1;
    CHECK(authorizeSdSector0Read(request) == SdSectorReadStatus::LbaForbidden);
    request.lba = 0;
    request.blockCount = 2;
    CHECK(authorizeSdSector0Read(request) ==
          SdSectorReadStatus::BlockCountInvalid);
    request.blockCount = 1;
    CHECK(authorizeSdSector0Read(request) == SdSectorReadStatus::ResourcesMissing);
    request.ownedResources = kSdIdentificationResources;
    request.conflictingOwner = true;
    CHECK(authorizeSdSector0Read(request) == SdSectorReadStatus::ResourceConflict);
    request.conflictingOwner = false;
    CHECK(authorizeSdSector0Read(request) == SdSectorReadStatus::Permitted);

    SdCommandFrame frame;
    CHECK(encodeSdReadSingleBlockCommand(0, &frame) == SdWireStatus::Valid);
    const std::array<std::uint8_t, 6> expectedCmd17{0x51, 0, 0, 0, 0, 0x55};
    CHECK(frame.bytes == expectedCmd17);

    class VectorByteSource final : public SdByteSource {
    public:
        explicit VectorByteSource(std::vector<std::uint8_t> input)
            : input_(std::move(input)) {}
        bool readByte(std::uint8_t* value) override {
            if (value == nullptr || offset_ >= input_.size()) return false;
            *value = input_[offset_++];
            return true;
        }
    private:
        std::vector<std::uint8_t> input_;
        std::size_t offset_ = 0;
    };

    std::array<std::uint8_t, 512> mbr{};
    mbr[446] = 0x80;
    mbr[450] = 0x0C;
    mbr[454] = 0x00;
    mbr[455] = 0x08;
    mbr[458] = 0xE8;
    mbr[459] = 0x03;
    mbr[510] = 0x55;
    mbr[511] = 0xAA;
    const std::uint16_t wireCrc = sdCrc16(mbr.data(), mbr.size());
    std::vector<std::uint8_t> wire{0xFF, 0xFE};
    wire.insert(wire.end(), mbr.begin(), mbr.end());
    wire.push_back(static_cast<std::uint8_t>(wireCrc >> 8U));
    wire.push_back(static_cast<std::uint8_t>(wireCrc));
    VectorByteSource source(wire);
    std::array<std::uint8_t, 512> decoded{};
    std::uint16_t receivedCrc = 0;
    CHECK(readSdData512(source, 2, &decoded, &receivedCrc) == SdWireStatus::Valid);
    CHECK(decoded == mbr);
    CHECK(receivedCrc == wireCrc);
    wire[2] ^= 1U;
    VectorByteSource corruptBlock(wire);
    CHECK(readSdData512(corruptBlock, 2, &decoded, &receivedCrc) ==
          SdWireStatus::DataChecksumInvalid);

    const SdSector0Inspection inspected =
        inspectSdSector0(mbr, request.capacityBytes);
    CHECK(inspected.kind == SdSector0Kind::PartitionedMbr);
    CHECK(inspected.signatureValid);
    CHECK(inspected.partitionCount == 1);
    CHECK(inspected.firstPartitionType == 0x0C);
    CHECK(inspected.firstPartitionLba == 2048);
    CHECK(inspected.firstPartitionSectors == 1000);
    char report[512] = {};
    CHECK(formatSdSector0Json(inspected, report, sizeof(report)));
    CHECK(std::strstr(report, "\"sector_kind\":\"partitioned_mbr\"") != nullptr);

    std::array<std::uint8_t, 512> protective = mbr;
    protective[450] = 0xEE;
    CHECK(inspectSdSector0(protective, request.capacityBytes).kind ==
          SdSector0Kind::ProtectiveMbr);
    std::array<std::uint8_t, 512> exfat{};
    std::memcpy(exfat.data() + 3, "EXFAT   ", 8);
    exfat[510] = 0x55;
    exfat[511] = 0xAA;
    CHECK(inspectSdSector0(exfat, request.capacityBytes).kind ==
          SdSector0Kind::ExfatBoot);
    std::array<std::uint8_t, 512> fat{};
    fat[0] = 0xEB;
    fat[11] = 0x00;
    fat[12] = 0x02;
    fat[13] = 8;
    fat[14] = 32;
    fat[16] = 2;
    fat[510] = 0x55;
    fat[511] = 0xAA;
    CHECK(inspectSdSector0(fat, request.capacityBytes).kind ==
          SdSector0Kind::FatBoot);
    fat[510] = 0;
    CHECK(inspectSdSector0(fat, request.capacityBytes).kind ==
          SdSector0Kind::InvalidSignature);

    request.lba = inspected.firstPartitionLba;
    CHECK(authorizeSdPartitionBootRead(inspected, request) ==
          SdSectorReadStatus::Permitted);
    request.lba = inspected.firstPartitionLba + 1;
    CHECK(authorizeSdPartitionBootRead(inspected, request) ==
          SdSectorReadStatus::LbaForbidden);
    request.lba = inspected.firstPartitionLba;
    request.blockCount = 2;
    CHECK(authorizeSdPartitionBootRead(inspected, request) ==
          SdSectorReadStatus::BlockCountInvalid);
    request.blockCount = 1;

    std::array<std::uint8_t, 512> fat32{};
    fat32[0] = 0xEB;
    std::memcpy(fat32.data() + 3, "MSDOS5.0", 8);
    fat32[11] = 0x00;
    fat32[12] = 0x02;
    fat32[13] = 8;
    fat32[14] = 32;
    fat32[16] = 2;
    fat32[21] = 0xF8;
    fat32[32] = 0xE8;
    fat32[33] = 0x03;
    fat32[36] = 10;
    fat32[44] = 2;
    fat32[48] = 1;
    fat32[50] = 6;
    fat32[67] = 0x78;
    fat32[68] = 0x56;
    fat32[69] = 0x34;
    fat32[70] = 0x12;
    std::memcpy(fat32.data() + 71, "LESHY TEST ", 11);
    fat32[510] = 0x55;
    fat32[511] = 0xAA;
    const SdFilesystemBootInspection boot =
        inspectSdFilesystemBoot(fat32, inspected.firstPartitionSectors);
    CHECK(boot.kind == SdFilesystemBootKind::Fat32);
    CHECK(boot.geometryValid);
    CHECK(boot.bytesPerSector == 512);
    CHECK(boot.rootCluster == 2);
    CHECK(boot.reservedSectors == 32);
    CHECK(boot.fatCount == 2);
    CHECK(boot.mediaDescriptor == 0xF8);
    CHECK(boot.fsInfoSector == 1);
    CHECK(boot.backupBootSector == 6);
    CHECK(boot.volumeSerial == 0x12345678U);
    CHECK(std::strcmp(boot.volumeLabel.data(), "LESHY TEST ") == 0);
    CHECK(formatSdFilesystemBootJson(boot, report, sizeof(report)));
    CHECK(std::strstr(report, "\"filesystem\":\"fat32\"") != nullptr);

    std::uint32_t rootDirectoryLba = 0;
    CHECK(calculateSdFat32RootDirectoryLba(
        inspected, boot, &rootDirectoryLba));
    CHECK(rootDirectoryLba == 2100);
    request.lba = rootDirectoryLba;
    CHECK(authorizeSdFat32RootDirectoryRead(inspected, boot, request) ==
          SdSectorReadStatus::Permitted);
    request.lba = rootDirectoryLba + 1;
    CHECK(authorizeSdFat32RootDirectoryRead(inspected, boot, request) ==
          SdSectorReadStatus::LbaForbidden);
    request.lba = rootDirectoryLba;
    request.blockCount = 2;
    CHECK(authorizeSdFat32RootDirectoryRead(inspected, boot, request) ==
          SdSectorReadStatus::BlockCountInvalid);
    request.blockCount = 1;
    request.lba = rootDirectoryLba + 1;
    CHECK(authorizeSdFat32RootDirectorySectorRead(
              inspected, boot, 1, request) == SdSectorReadStatus::Permitted);
    request.lba = rootDirectoryLba + 2;
    CHECK(authorizeSdFat32RootDirectorySectorRead(
              inspected, boot, 1, request) == SdSectorReadStatus::LbaForbidden);
    request.lba = rootDirectoryLba + 8;
    CHECK(authorizeSdFat32RootDirectorySectorRead(
              inspected, boot, 8, request) == SdSectorReadStatus::LbaForbidden);
    request.lba = rootDirectoryLba;

    std::array<std::uint8_t, 512> directory{};
    std::memcpy(directory.data(), "SECRET  TXT", 11);
    directory[11] = 0x20;
    std::memcpy(directory.data() + 32, "PRIVATE    ", 11);
    directory[32 + 11] = 0x10;
    std::memcpy(directory.data() + 64, "MY VOLUME  ", 11);
    directory[64 + 11] = 0x08;
    directory[96] = 0x41;
    directory[96 + 1] = 'P';
    directory[96 + 3] = 'r';
    directory[96 + 5] = 'i';
    directory[96 + 7] = 'v';
    directory[96 + 9] = 'a';
    directory[96 + 11] = 0x0F;
    directory[128] = 0xE5;
    directory[160] = 'X';
    directory[160 + 11] = 0xC0;
    directory[192] = 0x00;
    const SdFat32DirectoryInspection directoryInspection =
        inspectSdFat32DirectoryMetadata(directory);
    CHECK(directoryInspection.entriesExamined == 7);
    CHECK(directoryInspection.activeEntries == 5);
    CHECK(directoryInspection.deletedEntries == 1);
    CHECK(directoryInspection.longNameEntries == 1);
    CHECK(directoryInspection.volumeLabelEntries == 1);
    CHECK(directoryInspection.directoryEntries == 1);
    CHECK(directoryInspection.fileEntries == 1);
    CHECK(directoryInspection.invalidEntries == 1);
    CHECK(directoryInspection.endMarkerSeen);
    char directoryReport[512] = {};
    CHECK(formatSdFat32DirectoryMetadataJson(
        directoryInspection, directoryReport, sizeof(directoryReport)));
    CHECK(std::strstr(directoryReport,
                      "\"privacy_policy\":\"counts_hash_only\"") != nullptr);
    CHECK(std::strstr(directoryReport, "\"names_retained\":false") != nullptr);
    CHECK(std::strstr(directoryReport, "SECRET") == nullptr);
    CHECK(std::strstr(directoryReport, "PRIVATE") == nullptr);
    CHECK(std::strstr(directoryReport, "MY VOLUME") == nullptr);

    std::array<std::uint8_t, 512> fullDirectory{};
    for (std::size_t offset = 0; offset < fullDirectory.size(); offset += 32) {
        fullDirectory[offset] = 'A';
        fullDirectory[offset + 11] = 0x20;
    }
    SdFat32DirectoryAggregate aggregate;
    CHECK(appendSdFat32DirectoryMetadata(fullDirectory, &aggregate));
    CHECK(!aggregate.endMarkerSeen);
    CHECK(appendSdFat32DirectoryMetadata(directory, &aggregate));
    CHECK(aggregate.sectorsInspected == 2);
    CHECK(aggregate.entriesExamined == 23);
    CHECK(aggregate.activeEntries == 21);
    CHECK(aggregate.endMarkerSeen);
    CHECK(!appendSdFat32DirectoryMetadata(directory, &aggregate));
    std::array<std::uint8_t, 1024> combined{};
    std::memcpy(combined.data(), fullDirectory.data(), fullDirectory.size());
    std::memcpy(combined.data() + fullDirectory.size(),
                directory.data(), directory.size());
    CHECK(aggregate.crc32c == crc32c(combined.data(), combined.size()));
    CHECK(formatSdFat32DirectoryAggregateJson(
        aggregate, directoryReport, sizeof(directoryReport)));
    CHECK(std::strstr(directoryReport, "\"sectors_inspected\":2") != nullptr);
    CHECK(std::strstr(directoryReport, "SECRET") == nullptr);

    std::uint32_t fsInfoLba = 0;
    CHECK(calculateSdFat32FsInfoLba(inspected, boot, &fsInfoLba));
    CHECK(fsInfoLba == 2049);
    request.lba = fsInfoLba;
    CHECK(authorizeSdFat32FsInfoRead(inspected, boot, request) ==
          SdSectorReadStatus::Permitted);
    request.lba = fsInfoLba + 1;
    CHECK(authorizeSdFat32FsInfoRead(inspected, boot, request) ==
          SdSectorReadStatus::LbaForbidden);
    request.lba = fsInfoLba;

    std::array<std::uint8_t, 512> fsInfo{};
    fsInfo[0] = 0x52;
    fsInfo[1] = 0x52;
    fsInfo[2] = 0x61;
    fsInfo[3] = 0x41;
    fsInfo[484] = 0x72;
    fsInfo[485] = 0x72;
    fsInfo[486] = 0x41;
    fsInfo[487] = 0x61;
    fsInfo[488] = 100;
    fsInfo[492] = 5;
    fsInfo[510] = 0x55;
    fsInfo[511] = 0xAA;
    SdFat32FsInfoInspection fsInfoInspection =
        inspectSdFat32FsInfo(fsInfo, boot);
    CHECK(fsInfoInspection.signaturesValid);
    CHECK(fsInfoInspection.hintsValid);
    CHECK(fsInfoInspection.dataClusters == 118);
    CHECK(fsInfoInspection.freeCountKnown);
    CHECK(fsInfoInspection.freeClusters == 100);
    CHECK(fsInfoInspection.nextFreeKnown);
    CHECK(fsInfoInspection.nextFreeCluster == 5);
    CHECK(formatSdFat32FsInfoJson(
        fsInfoInspection, directoryReport, sizeof(directoryReport)));
    CHECK(std::strstr(directoryReport,
                      "\"technical_metadata_only\":true") != nullptr);
    std::array<std::uint8_t, 512> unknownFsInfo = fsInfo;
    std::memset(unknownFsInfo.data() + 488, 0xFF, 8);
    fsInfoInspection = inspectSdFat32FsInfo(unknownFsInfo, boot);
    CHECK(fsInfoInspection.hintsValid);
    CHECK(!fsInfoInspection.freeCountKnown);
    CHECK(!fsInfoInspection.nextFreeKnown);
    std::array<std::uint8_t, 512> invalidFsInfo = fsInfo;
    invalidFsInfo[0] = 0;
    CHECK(!inspectSdFat32FsInfo(invalidFsInfo, boot).hintsValid);
    invalidFsInfo = fsInfo;
    invalidFsInfo[488] = 119;
    CHECK(!inspectSdFat32FsInfo(invalidFsInfo, boot).hintsValid);
    SdFilesystemBootInspection invalidFsInfoBoot = boot;
    invalidFsInfoBoot.fsInfoSector = invalidFsInfoBoot.reservedSectors;
    CHECK(!calculateSdFat32FsInfoLba(
        inspected, invalidFsInfoBoot, &fsInfoLba));

