anton-vinogradov/esp32-leshy/tests/native/clean_target_tests.cpp
    std::uint32_t firstFatLba = 0;
    CHECK(calculateSdFat32FirstFatLba(inspected, boot, &firstFatLba));
    CHECK(firstFatLba == 2080);
    request.lba = firstFatLba;
    CHECK(authorizeSdFat32FirstFatSectorRead(inspected, boot, request) ==
          SdSectorReadStatus::Permitted);
    request.lba = firstFatLba + 1;
    CHECK(authorizeSdFat32FirstFatSectorRead(inspected, boot, request) ==
          SdSectorReadStatus::LbaForbidden);
    request.lba = firstFatLba;
    request.blockCount = 2;
    CHECK(authorizeSdFat32FirstFatSectorRead(inspected, boot, request) ==
          SdSectorReadStatus::BlockCountInvalid);
    request.blockCount = 1;

    std::array<std::uint8_t, 512> fatSector{};
    fatSector[0] = 0xF8;
    fatSector[1] = 0xFF;
    fatSector[2] = 0xFF;
    fatSector[3] = 0x0F;
    fatSector[4] = 0xFF;
    fatSector[5] = 0xFF;
    fatSector[6] = 0xFF;
    fatSector[7] = 0x0F;
    fatSector[8] = 0xFF;
    fatSector[9] = 0xFF;
    fatSector[10] = 0xFF;
    fatSector[11] = 0x0F;
    SdFat32ReservedInspection fatInspection =
        inspectSdFat32ReservedAndRootEntries(fatSector, boot);
    CHECK(fatInspection.fat0Valid);
    CHECK(fatInspection.fat1ReservedBitsValid);
    CHECK(fatInspection.cleanShutdown);
    CHECK(fatInspection.noHardError);
    CHECK(fatInspection.rootEntryKind == SdFat32EntryKind::EndOfChain);
    CHECK(fatInspection.rootEntryValid);
    CHECK(!fatInspection.rootChainContinues);
    CHECK(fatInspection.structureValid);
    CHECK(formatSdFat32ReservedInspectionJson(
        fatInspection, directoryReport, sizeof(directoryReport)));
    CHECK(std::strstr(directoryReport, "\"entries_inspected\":3") != nullptr);
    CHECK(std::strstr(directoryReport, "\"fat_chain_followed\":false") != nullptr);

    SdFat32FsInfoCrossCheck crossCheck =
        crossCheckSdFat32FsInfoWithReservedEntries(
            inspectSdFat32FsInfo(fsInfo, boot), fatInspection, boot);
    CHECK(crossCheck.available);
    CHECK(crossCheck.freeHintCompatible);
    CHECK(crossCheck.nextFreeHintCompatible);
    CHECK(crossCheck.compatible);

    std::array<std::uint8_t, 512> changedFat = fatSector;
    changedFat[7] &= static_cast<std::uint8_t>(~0x08U);
    fatInspection = inspectSdFat32ReservedAndRootEntries(changedFat, boot);
    CHECK(fatInspection.structureValid);
    CHECK(!fatInspection.cleanShutdown);
    CHECK(fatInspection.noHardError);
    changedFat = fatSector;
    changedFat[7] &= static_cast<std::uint8_t>(~0x04U);
    fatInspection = inspectSdFat32ReservedAndRootEntries(changedFat, boot);
    CHECK(fatInspection.structureValid);
    CHECK(fatInspection.cleanShutdown);
    CHECK(!fatInspection.noHardError);
    changedFat = fatSector;
    changedFat[8] = 5;
    changedFat[9] = 0;
    changedFat[10] = 0;
    changedFat[11] = 0;
    fatInspection = inspectSdFat32ReservedAndRootEntries(changedFat, boot);
    CHECK(fatInspection.rootEntryKind == SdFat32EntryKind::Data);
    CHECK(fatInspection.rootChainContinues);
    CHECK(fatInspection.rootEntryValid);
    crossCheck = crossCheckSdFat32FsInfoWithReservedEntries(
        inspectSdFat32FsInfo(fsInfo, boot), fatInspection, boot);
    CHECK(crossCheck.available);
    CHECK(!crossCheck.nextFreeHintCompatible);
    CHECK(!crossCheck.compatible);
    changedFat[8] = 2;
    fatInspection = inspectSdFat32ReservedAndRootEntries(changedFat, boot);
    CHECK(!fatInspection.rootEntryValid);
    changedFat = fatSector;
    changedFat[0] = 0xF0;
    CHECK(!inspectSdFat32ReservedAndRootEntries(changedFat, boot).structureValid);
    changedFat = fatSector;
    std::memset(changedFat.data() + 8, 0, 4);
    fatInspection = inspectSdFat32ReservedAndRootEntries(changedFat, boot);
    CHECK(fatInspection.rootEntryKind == SdFat32EntryKind::Free);
    CHECK(!fatInspection.rootEntryValid);
    crossCheck = crossCheckSdFat32FsInfoWithReservedEntries(
        inspectSdFat32FsInfo(fsInfo, boot), fatInspection, boot);
    CHECK(!crossCheck.available);

    std::array<std::uint8_t, 512> incompatibleFsInfo = fsInfo;
    incompatibleFsInfo[488] = 118;
    fatInspection = inspectSdFat32ReservedAndRootEntries(fatSector, boot);
    crossCheck = crossCheckSdFat32FsInfoWithReservedEntries(
        inspectSdFat32FsInfo(incompatibleFsInfo, boot), fatInspection, boot);
    CHECK(crossCheck.available);
    CHECK(!crossCheck.freeHintCompatible);
    CHECK(!crossCheck.compatible);
    incompatibleFsInfo = fsInfo;
    incompatibleFsInfo[492] = 2;
    crossCheck = crossCheckSdFat32FsInfoWithReservedEntries(
        inspectSdFat32FsInfo(incompatibleFsInfo, boot), fatInspection, boot);
    CHECK(crossCheck.available);
    CHECK(!crossCheck.nextFreeHintCompatible);
    CHECK(!crossCheck.compatible);

    SdFilesystemBootInspection invalidRoot = boot;
    invalidRoot.rootCluster = 0xFFFFFFFFU;
    CHECK(!calculateSdFat32RootDirectoryLba(
        inspected, invalidRoot, &rootDirectoryLba));
    CHECK(authorizeSdFat32RootDirectoryRead(inspected, invalidRoot, request) ==
          SdSectorReadStatus::LbaForbidden);
    fat32[510] = 0;
    CHECK(inspectSdFilesystemBoot(fat32, inspected.firstPartitionSectors).kind ==
          SdFilesystemBootKind::Invalid);
}

}  // namespace

int main() {
    testVisualThemeContract();
    testUiComponentGeometryContract();
    testTouchInputIsEdgeTriggeredAndBounded();
    testTouchTargetsExposeRowsButNeverChrome();
    testLanguageCatalogAndControllerAreBounded();
    testSelfTestQuickIsReadOnlyBoundedAndFullFailsClosed();
    testDisposableScratchCleanupPermitIsExactAndFailClosed();
    testShieldReceiverIdentityContractFailsClosed();
    testNrf24PassiveSpectrumContractAndControllerAreBounded();
    testCc1101PassiveSpectrumContractAndControllerAreBounded();
    testSubGhzRawCaptureIsPassiveBoundedAndNonBlocking();
    testSubGhzRawCapturePersistsAndReopensWithoutTxSemantics();
    testInfraredCaptureIsBoundedAndDecodesNecWithoutTxSemantics();
    testSpectrumViewportKeepsBoundedRingHistory();
    testProductBootRetryIsNarrowAndBounded();
    testSafetySupervisorLatchesOnlyExactUntornEvidence();
    testProductStartIdentityRetryStopsBeforeFilesystem();
    testStorageTimingSummaryUsesNearestRank();
    testIngressRateSummaryUsesNearestRankAndRejectsZero();
    testObservationQueueIsBoundedFifoAndScrubbable();
    testSessionBatchPolicyMeetsMeasuredRateAndFlushesBoundedly();
    testInventoryIsFixedAndRejectsDuplicates();
    testBootReportIsBoundedAndMachineReadable();
    testHilSessionBindsOneRunToTheRunningAppIdentity();
    testPhysicalAndDiagnosticActionsShareNavigation();
    testPhysicalButtonFrontendDebouncesAndMapsEveryKey();
    testPhysicalButtonFrontendRejectsAmbiguousPressesAndRecovers();
    testAppCatalogProjectsCapabilityStatesBeforeLaunch();
    testRuntimeAcquiresAtomicallyAndBackReleasesEverything();
    testWifiIngressIsPassiveOnlyAndNormalizesObservations();
    testWifiNetworkCatalogKeepsStableUniqueRows();
    testBleIngressIsReceiveOnlyBoundedAndNormalizesObservations();
    testSurveySessionIsOrderedBoundedAndStopIsIdempotent();
    testSourceDegradationKeepsOnlyCompatibleSourcesRunning();
    testSourceTimelineStreamsHonestDutyWindowsAndDrops();
    testSourceTimelineOverflowRejectsStateChangeAndCanDrain();
    testSessionTimelinePersistsBoundedHistoryAndExactAggregates();
    testGoldenSurveyTraceUsesListDetailBackAndExplicitStop();
    testSurveyBrowserFiltersSourcesAndBuildsBoundedRssiHistory();
    testSurveySourcePlanProjectsAvailabilityAndRequiresSelection();
    testSurveyWorkflowCommitsOnceAndPreservesPriorLibraryOnFailure();
    testSessionStoreIoRouterSwitchesOnlyTheSelectedBackend();
    testSurveyPipelineQueuesDrainsDropsAndCommitsWithStopPolicy();
    testProductStorePolicySeparatesReadOnlyBootFromExplicitWrites();
    testProductSurveyAdmissionNeverFallsBackToSimulatedOrRam();
    testSessionCodecCommitsCanonicalDataAndReopensOffline();
    testSessionCodecRoundTripsBleWithoutInventingWifiFields();
    testCaptureMetadataV3AndCsvExportAreCanonical();
    testWifiFrameCaptureExportsByteExactRadiotapPcap();
    testOfflineLibraryControllerIsBoundedAndPreservesProvenance();
    testSessionCatalogRecoversReadOnlyAndMarksFallbackIntegrity();
    testBoundedSessionStoreCommitsRecoversAndFallsBack();
    testSessionStoreBoundaryWrapperStopsAfterEachSuccessfulBoundary();
    testRamSessionStoreAdapterMatchesBoardFixtureContract();
    testHeadEncodingAndRecoveryRejectsUncommittedData();
    testEveryCommitBoundaryPreservesAValidGeneration();
    testStorageWritesRequireExactDisposableScope();
    testMediaDiscoveryBoundaryIsReadOnlyAndFailClosed();
    testReadOnlyMountAuthorizationRequiresSelectionDriverAndLeases();
    testSdIdentificationProtocolCannotDriftIntoWrites();
    testSdIdentificationParserRejectsTranscriptFaults();
    testSdIdentificationStateMachineIsBoundedAndFakeOnly();
    testSdSpiWireCodecIsBoundedAndReadOnly();
    testSdSector0ReadIsSingleBoundedAndParseOnly();
    if (failures != 0) return EXIT_FAILURE;
    std::cout << "clean 1.x target contract tests passed\n";
    return EXIT_SUCCESS;
}
